[
    {
        "id" : 1,
        "name": "African Violet",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "African violets hail from the foggy cloud forests of eastern tropical Africa. There are six to 20 true species in the Saintpaulias genus, named after Baron Walter von Saint Paul-Illaire, who sent seeds from Tanzania back to his botanist father in Germany. Hundreds of sub-species and hybrids have been bred by collectors, so there are an astonishing array of flower types and colors available online or from flower show vendors.",
        "care": "African violets need bright, indirect light such as from a south- or east-facing window, although direct sunlight can burn the leaves. They will do best at 65 to 75°F (18 to 24°C), and although they can survive temperatures up to about 90°F (32°C), they will die if exposed to below 50°F (10°C). The best soil for an African violet is actually a “soil-less” mix that stays moist but isn’t too dense, allowing air to circulate around the roots. You can mix your own from one part brown sphagnum peat moss, one part vermiculite, and one part perlite. Water African violets with room-temperature water when the top of the soil feels dry to the touch, and be sure to let the soil dry out before watering again. If the soil is dry, but you’re still unsure whether your violet needs to be watered, feel a leaf to see whether it feels limp. Limp leaves plus dry soil means it’s time to water. Limp leaves plus wet soil probably means you’re overwatering or using the wrong potting mix.",
        "propogate": "First, remove a fresh, mature leaf from a plant that you want to propagate. Then, cut the leaf stem from a sharp, clean knife or blade at a 45-degree angle to about ½” in length. Next,fill a small pot with a very light and porous rooting mix, and bury the stem up to the bottom of the leaf. Fianlly, cover the pot with a clear plastic bag to help retain moisture, and place it near bright light but out of the direct sun. The leaf should grow roots in about a month and produce tiny plantlets that will be ready to be transferred to their own pots in 2-5 months. Alternately, you can root a leaf in water, but you’ll need to ensure that only the stem is in the water, not the leaf. You can use a container with a long neck, like a beer bottle, or put plastic wrap over a glass jar, then poke the stem through a hole. Transfer to potting mix when the roots are about ¼”, and wait for plantlets to develop.",
    },
    {
        "id" : 2,
        "name": "Aglaonema",
        "size": "large",
        "difficulty": "easy",
        "light": "low",
        "flowering": "no",
        "water": "low",
        "about": "Chinese evergreen plants, also known by their genus, Aglaonema, hail from the shaded floors of Southeast Asian tropical forests. There are over 20 known species, which vary in their leaf patterns and colors. Cultivars are available with streaks and speckles of white, yellow, or even pink and red.",
        "care": "These plants are one of the few that won’t simply tolerate low lighting but can actually do well in it. Many people like Chinese evergreens for office plants and rooms without windows because they can grow from just being exposed to artificial light. They can also handle bright indirect sunlight, but be conscious of direct sun as it can burn the leaves. It’s best to keep these plants between 65 and 80 degrees Fahrenheit. While sweltering heat doesn’t mix well with Chinese evergreens, it’s cold, drafty rooms that you should be more careful of. These plants thrive in warmer temperatures with a bit of humidity as opposed to super chilly and dry conditions.",
        "propogate": "Propagating these plants is fairly simple, and they don’t have a tough time sprouting roots. The following steps will help you get started. First, using a pair of scissors or a knife, cut off a few six-inch long stems. Then, collect your cuttings, then place them in cups of water on a window sill where they can get indirect sunlight. Finally, once roots begin growing, you can remove the stems and place them into pots of soil. Many people say, too, that you can transfer Chinese evergreen cuttings directly to soil because of their ability to easily grow roots, which is always an option if you’re short on time or patience.",
    },
    {
        "id" : 3,
        "name": "Air Plant",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "Most airplants sold in shops are members of the Tillandsia genus. They are epiphytes that cling to the crooks and branches of trees in Central and South America, the West Indies, and southern United States. There are varieties adapted to grow in rainforests, mountains, deserts and swamps, but what they all have in common is that they grow without rooting in soil.The ASPCA doesn’t have an entry about airplants, but other sources indicate that they’re likely non-toxic to pets. Stories abound of pets thinking that airplants are a fun new toy or snack, however, which doesn’t usually end well for the plant, so you’ll probably want to keep your airplants away from your furry companions.",
        "care": "If you’re thinking, “Care? What care?” that’s one of the common misconceptions about air plants. Despite the name, they need regular watering in addition to air. How often you need to water will vary depending on the temperature, light, and humidity, which will likely change throughout the year. Brighter, hotter, and drier conditions means your plant will need to be watered more often, while colder, darker, damper conditions means less watering is necessary. As with most plants, it is easier to kill by over-watering than under-watering, so err on the side of benign neglect.",
        "propogate": "Once in its lifetime, an airplant will flower, and around this time it will send out “pups,” baby airplants. Leave the baby plants attached to the mother until they’re about ½-to-⅓ of the mother plant size, then gently pull or cut them free. After it has flowered, the mother plant will eventually die. (Cue Lion King’s “Circle of Life.”)",
    },
    {
        "id" : 4,
        "name": "Aloe",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "There are hundreds of varieties of aloe plants, which are indigenous to Africa and a few neighboring areas. Aloes come in many varieties that range in size from a few inches to tree heights of 30 to 40 feet, in the case of the kokerboom (or quiver tree). They also come in many colors and shapes, including orange-hued, purple-tinged, and with various spine configurations. Some aloes also flower. Though many might think of the aloe plant as a cactus, it is actually a succulent. We’ll consider the aloe barbadensi, commonly known as aloe vera, here.",
        "care": "Aloe vera plants are tolerant of dry conditions, but that doesn’t mean we shouldn’t water them! In the summer months, soak them thoroughly (make sure soil has good drainage), but allow them to dry very well between waterings (dry to a depth of 1 to 2 inches). During winter months, when the plant is dormant, water less frequently, if at all.",
        "propogate": "Mature aloe vera plants propagate through offshoots, or “pups,” which can be removed and replanted. Cut the offshoots with a knife once the leaves unfurl and let the cut dry over (usually a couple days) before planting it. Check out How To Grow Stuff for detailed instructions.",
    },
    {
        "id" : 5,
        "name": "Areca Palm",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "The areca palm, otherwise known as butterfly palm, golden cane palm, bamboo palm, or its Latin name, Dypsis lutescens, is a native of Madagascar. The ASPCA says that areca palms are non-toxic to both dogs and cats.",
        "care": "The fastest way to accidentally kill this plant is by overwatering and/or not providing drainage, so watch out for this common pitfall. Plant in well-draining potting soil, in a pot with drainage holes. Allow the top of the soil to dry out between waterings, and water less often during the winter months.",
        "propogate": "The best way to propagate this plant is by gently dividing clumps when repotting. Root rot is the biggest killer, but it can be avoided by watering properly (see above), and not keeping the soil soggy. Brown leaf tips may appear if the air is too dry, which also makes this plant more susceptible to pests like spider mites and mealybugs. If you notice an infestation, use insecticidal soap to eradicate either of these pests, and consider moving the plant to a more humid spot, or otherwise increasing the humidity.",
    },
    {
        "id" : 6,
        "name": "Asparagus Fern",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "There are many varieties of asparagus ferns, but the one you’re most likely to encounter is Asparagus densiflorus ‘Sprengeri’. It has fine, soft needles on long stems that trail nicely down the sides of a hanging basket. Another popular variety is Asparagus densiflorus ‘Myersii’, commonly called foxtail fern. Foxtail ferns look similar to Sprengeri, but have long upright stems, so they look best in a pot rather than a hanging planter.",
        "care": "Plant asparagus ferns in an all-purpose potting mix. Caution: Despite their soft, fluffy appearance, asparagus ferns actually have small thorns, so wear gloves when handling them. Re-pot in a larger planter if the pot becomes root-bound or you notice vigorous root growth lifting the soil out of the pot. Asparagus ferns will grow in bright to low light, and even do well with artificial light. In lower light conditions, the foliage may turn a lighter shade of green. It’s common to move the plant outdoors during summer.",
        "propogate": "Asparagus fern can be propagated from seed and division. Seeds will germinate in 3-4 weeks at room temperature. Scarify the seeds and soak in water for a day before planting to hasten germination. Plants can be separated into smaller pieces or the tubers will regenerate plants. Spring is the best time for division but these tough plants can be propagated at almost any time of the year.",
    },
    {
        "id" : 7,
        "name": "Avacado",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "",
        "care": "",
        "propogate": "",
    },
    {
        "id" : 8,
        "name": "Bamboo Plant",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "Indoor bamboo plants are usually of the Dracaena sanderiana variety, also known as “lucky bamboo.” They are bright and cheery, a chartreuse splash of color that invigorates an office space or an overlooked corner of your home. With the right knowledge, bamboo plants are relatively easy to care for. Here are our tips.",
        "care": "Bamboo plants enjoy bright indirect light but can tolerate low light conditions, although they will grow more slowly. Ideal temperatures are in the 60 to 70-degree range, which isn’t a problem in most home or office conditions. Bamboo plants can go for a long time with just water. However, they will benefit from a small drop of fertilizer added to their water when you give them fresh water. If your bamboo plant is in soil, fertilize with a high-nitrogen, slow-release formula in the spring, according to the manufacturer’s directions.",
        "propogate": "Bamboo plants are easy to propagate. In fact, part of the reason they are easy plants to grow is that when you have problems with them, you can cut away the affected portion and keep the unaffected parts of the plant. To multiply your plant, cut about an inch above a node, dip the cut in rooting powder and let it dry overnight before placing it in a new container. To encourage new growth on the parent stalk, mist with water every couple of days.",
    },
    {
        "id" : 9,
        "name": "Banana Plant",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "Here’s a fun fact: People call them trees, but bananas (Musa) actually grow from gigantic bulbs, just like daffodils or tulips. What looks like a trunk is really a pseudo trunk made up of leaf petioles (stalks) stacked tightly together, according to Logee’s Greenhouse. ",
        "care": "Banana plants are frequently grown outdoors in the summer. At the end of the growing season, gardeners cut back the foliage, dig up the bulbs, and store them in a cool, dry spot in the basement or garage for the winter—much like they do with dahlias and elephant ears. But if you have an abundance of sunlight, it’s also possible to grow an ornamental banana indoors year-round. Banana plants need plenty of bright light. Plant delivery service Bloomscape recommends a south-facing window and a minimum of 4-6 hours of full sunlight per day. You can also keep them outdoors during summer.",
        "propogate": "Bananas and plantains(cultivar of Musa) are propagated vegetatively rather than sexually because nearly all cultivated varieties are seedless, and fruits develop parthenocarpically (in the absence of seed development). The principal method of banana propagation by small-holder farmers is divison of suckers or pups which arise from the base of the main stem or from the underground corm. Farmers from different regions prefer different size suckers for optimal planting material. Very small pups are called buttons. Large suckers are the preferred planting material. These are removed from vigorous clumps of banana trees with a spade when at least three feet tall, during warm months. Pups should not be taken until a clump has at least three to four large banana plants to anchor it. When the pup is taken the cut must be into the mother banana plant enough to obtain some roots. Plant close to the surface. Large leaves are cut off of the pup leaving only the youngest leaves or no leaves at all.",
    },
    {
        "id" : 10,
        "name": "Basil",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "Windowsills are basically made for DIY herb gardens, and if you haven’t created your own yet, this is your sign. The list of plants you can include in your mini indoor garden is lengthy. You can cultivate mint for things like teas and mojitos, grow chives for added flavor, and harvest your own cilantro for salsas and pickling. Another one of the most versatile herbs is basil, and if its number of uses aren’t reason enough, its ease of growing will convince you to add it to your roster of herbs. ",
        "care": "Basil likes moist soil and should be watered as soon as its soil gets dry. Because basil doesn’t fare well in chilly conditions, room temperature to lukewarm water is best for the plant. Although it loves water, soil that drains well is still essential, as well as direct sunlight that it can soak up for six to eight hours a day. When you start to see flowers, or your basil starts getting to be taller, you can begin pinching the top leaves with your fingers and pruning the flowers. This encourages your plant to grow bushier, rather than taller,  and directs your plant to grow leaves rather than blooms.",
        "propogate": "Take your scissors or knife and cut off four to five-inch long stems. You should cut these pieces off right at a node (where a leaf and stem meet). Collect however many cuttings you’d like, then remove all the leaves off from the bottom two inches of your cutting. It’ll look a bit bare, but this’ll prevent leaves from molding or rotting in the water. Place your cuttings into the cups of water—you can place two or three in each cup—and set them in an area where they can get plenty of light without getting burnt. Change out the water every day so the water doesn’t become stagnant and harm your plants, too. Once your plants start to grow roots, which may take a week or more, monitor them until the roots are a couple of inches long; this can take another week or two. Once they’ve reached this length, you can successfully transfer them into planters with potting soil. You can also propagate basil cuttings directly into soil. Follow the same steps, but rather than placing them into cups of water, you can plant them directly into soil. If you use this method, it’s best to buy a root hormone to dip their ends into before planting as this will really encourage roots to form.",
    },
    {
        "id" : 11,
        "name": "Begonia",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "Begonias are some of the most beautiful, visually interesting plants you can grow indoors. However, they can be a bit picky about light and water, though not overly delicate, making them a great intermediate-level plant project. Here’s what you need to know.",
        "care": "Striking the right balance with watering is the biggest challenge when growing begonias. Ideally, the soil should be slightly damp at all times but not too wet because begonias are very sensitive to overwatering and can easily develop root rot. Test the soil with your finger before watering — the top inch (approximately up to your first knuckle) should feel dry. If you are unsure if you should water, it is best to err on the side of caution and wait until the leaves begin to droop slightly, indicating that the plant is drying out. Water the soil directly, keeping the leaves dry.Cane begonias need bright, indirect sunlight. Rhizomatous and rex begonias prefer a bit more shade. If leaves appear scorched, move your plant to a less sunny spot. Applying a liquid houseplant fertilizer according to the package instructions every two weeks will encourage bigger leaves and blooms",
        "propogate": "Begonias are fun and easy to propagate. Snip off a cutting and keep it in a jar of water until roots form before transferring it to a pot.",
    },
    {
        "id" : 12,
        "name": "Birds of Paradise",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "Birds of paradise are large, relatively easy to grow plants that lend a bold tropical flair to any indoor space. With proper care, a bird of paradise can grow to over six feet tall, even indoors. Its broad, arching leaves make a dramatic, graceful statement in your home. Here’s how to care for birds of paradise to keep them at their best.",
        "care": "Since birds of paradise are tropical plants, it’s no surprise that they enjoy bright sunlight. Place your indoor bird of paradise in a spot where it will get the most light. The only exception is if it’s very hot, such as in a sun room; in that case, bright, indirect light is best. If your plant’s leaves are yellowing, try increasing the amount of light exposure. Birds of paradise do best with a regular watering schedule. Keep the soil moist in spring and summer, during the growing season, but allow the soil to dry between waterings in the dormant fall and winter months.",
        "propogate": "It’s easy to propagate new bird of paradise plants. Dig up and separate the established clumps with four or five stems, then divide so that each division has a single stem. For best results, divide during late spring or early summer.",
    },
    {
        "id" : 13,
        "name": "Bird's Nest Fern",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "Whether or not you knew what it was called, you’ve probably seen a bird’s nest fern before and thought, “wow, what cool leaves”. Bird’s nest fern (Asplenium nidus) gets its common name from the tightly curled new leaves that emerge from a brown rosette in the center. No matter what shape you think the plant looks like, ferns add a touch of lush, tropical greenery to a home, much like the Maidenhair Fern or the Lemon Button Fern.",
        "care": "It’s best to plant bird’s nest fern in a porous, well-draining potting soil, advises the Missouri Botanical Garden. A good all-purpose mix should do the trick. Adequate drainage is key to preventing rot, so choose a pot with drainage holes in the bottom if possible.Rodale’s Encyclopedia of Indoor Gardening and The Houseplant Encyclopedia by Ingrid Jantra and Ursula Kruger both stress that direct sun will cause your bird’s nest fern to meet an untimely end. Keep the light filtered and subdued, but not completely shady. Consider a bright, north-facing window. As with most other ferns, consistent watering is essential to keeping this plant alive, according to the University of Florida Institute of Food and Agricultural Sciences (UF IFAS). It’s not going to forgive you if you abandon it for a few weeks and allow the soil to turn to dust—but you don’t want it to be soggy either. Follow the tried and true trick of sticking your finger in the soil down to your second knuckle and watering only if it’s dry. ",
        "propogate": "Rather than producing flowers or fruits with seeds, true ferns, including bird’s nest fern, propagate through spores that develop on the undersides of the leaves, according to UF IFAS. You’re better off buying a new plant from a greenhouse rather than trying to clone your own, which gets a bit complicated. ",
    },
    {
        "id" : 14,
        "name": "Boston Fern",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "The Boston fern, or Nephrolepis exaltata ‘Bostoniensis,’ is a type of sword fern that originated in humid forests and swamps. Its distinctive arching fronds are a mutation from the straight fronds of standard sword ferns. The popular stories are that the mutation either occurred on a ship full of ferns being sent to Boston or in the plant nursery of a Florida grower who later sent them to friends in Boston.",
        "care": "Especially during the spring and summer growing months, keep your fern’s soil moist, but not soggy. Slightly reduce watering during the winter (unless you’re overwintering in a dark area, see above). A self-watering pot is a good way to keep your fern’s soil moist, but you can also keep it in a plastic pot (inside a prettier cachepot) to help it stay hydrated. Pot in a rich soil high in peat moss. If your fern does briefly dry out and the fronds turn brown and die, you can probably revive it by cutting off all of the dead foliage at ground level and keeping the soil moist while it regenerates.",
        "propogate": "One popular method for propagating Boston ferns is through separating runners. Runners are small offshoots that grow from the main plant and can eventually become their own individual plants. Runners will have their own roots at the base of 2-3 fern stems that almost look like a small root ball. These offshoots will continue growing out from the center of the main plant, expanding the reach of the plant.",
    },
    {
        "id" : 15,
        "name": "Bromeliad",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "African violets hail from the foggy cloud forests of eastern tropical Africa. There are six to 20 true species in the Saintpaulias genus, named after Baron Walter von Saint Paul-Illaire, who sent seeds from Tanzania back to his botanist father in Germany. Hundreds of sub-species and hybrids have been bred by collectors, so there are an astonishing array of flower types and colors available online or from flower show vendors.",
        "care": "Bromeliads are very sensitive to moisture. It’s important that the pot and soil you choose are conducive to keeping them happy. While the plants are drought-tolerant and hate over-watering or standing in water, they do need moisture. Hence, if you leave in a dry, arid climate, a plastic pot that tends to retain moisture might be a good choice. On the other hand, if you live in a humid area, a porous pot is a good option, as it will allow excess water to seep away from the roots. Bromeliads do not need much fertilization. You could use a half or quarter dilution of all-purpose plant food, some slow-release pellets mixed in with their potting mix, or a single pellet dropped into the bromeliad’s water cup. Only fertilize during the growing season of spring and summer, and take care not to over-fertilize.",
        "propogate": "Bromeliads typically bloom only once in their lifetime, making the burst of color (actually formed mostly of leaf bracts) that much more precious. If you wish to force a bloom, do the following, as outlined in Gardening Know How: First, add some dissolved Epsom salts to the watering cup once per month for a few months to encourage chlorophyll production. Next, empty the water cup and encase the bromeliad in a large, clear plastic bag for 10 days along with a piece of apple. The ethylene gas encourages flowering, which should occur within the next six to 10 weeks.",
    },
    {
        "id" : 16,
        "name": "Burro's Tail",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "African violets hail from the foggy cloud forests of eastern tropical Africa. There are six to 20 true species in the Saintpaulias genus, named after Baron Walter von Saint Paul-Illaire, who sent seeds from Tanzania back to his botanist father in Germany. Hundreds of sub-species and hybrids have been bred by collectors, so there are an astonishing array of flower types and colors available online or from flower show vendors.",
        "care": "Sedums like burro’s tail need bright, direct light to grow properly. Make sure you turn your plant frequently to keep it from getting sunburned. Each leaf is covered with a chalky substance called epicuticular wax that helps protect it from the hot sunlight and keep its moisture in. Without enough sunlight, the plant will start to lose its leaves and turn more yellow than green. You might find that it becomes mushy, especially if light deprivation is paired with overwatering. If there’s one piece of advice that you take away, it’s that you should never overwater this plant. If you overwater it, there’s a pretty big chance that it will rot, especially if it’s a young plant. This is where that bit about picking the correct container comes in. Drainage is imperative. If you’re giving your plant the proper amount of light, you shouldn’t have to water more than once every two weeks. Let the soil dry out all the way through before watering it thoroughly. The only exception to this rule would be if you have a very young plant, one that’s in a two-inch pot, or a cutting. Then you’ll want to water with a lesser quantity, but more often. ",
        "propogate": "Like most succulents, Sedum morganianum is a snap to propagate.  Simply cut the stems to the length you want, peel the bottom 1/3 of the leaves off and then let those stems heal off (this is where the cut end of the stem callus over) for 2 weeks to 3 months before planting. When you plant your cuttings, you might need to pin them down in the pot because the weight of the stems will pull them out.  You can also propagate it by individual leaf cuttings which you’ll see in the picture below. Just a head’s up because the leaves break and fall off this plant very easily. If you want to know more on this subject, I’ve done an entire blog post about propagating sedums.",
    },
    {
        "id" : 17,
        "name": "Calathea",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "Calathea plants have a reputation for being finicky. Some varieties, such as the white fusion, are known among the plant community as “drama queens.” But the marantaceae family (which includes calathea and maranta, in addition to stromanthe and many others commercially known as “prayer plants”) is a vast family with a dizzying amount of varieties for houseplant hobbyists.",
        "care": "Like all houseplants, calathea enjoy filtered or dechlorinated water and can be a little more demanding than other houseplants. Simply fill your watering can and leave it overnight to dissipate the chlorine. If there are other chemicals in your tap water, try using filtered or distilled water instead. The light requirements make this plant an attractive choice for lower-light homes, but please note: These plants do poorly in direct sun, which can bleach the leaves. Place your prayer plant in a part of a room that receives low to bright indirect light. As a rule, the darker the foliage—such as with the calathea ornata—the lower the light requirements.",
        "propogate": "is an easy way to expand your Calathea collection or manage a plant's size. Calathea plants are best propagated through division, where the main plant is broken apart into multiple plants at the roots. It is best to divide plants during repotting, so you can see the root system as you separate the plants.The process is not difficult, but the mother plant must be big enough to provide an adequate root system for each new plant.",
    },
    {
        "id" : 18,
        "name": "Cast Iron Plant",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "A native of the forest floors of Japan and Taiwan, the cast-iron plant gained popularity in homes in Europe and America during the Victorian era, and it has gone in and out of fashion repeatedly since then. This evergreen foliage plant that can grow up to three feet tall regularly appears on lists of hard-to-kill houseplants and is perfect for homes, offices, and even dimly-lit bars.",
        "care": "While the cast-iron plant isn’t picky about regular watering, it does need some water, and really heavy overwatering can cause death by root-rot. Like many houseplants, it would rather be too dry than too wet, so let it dry out between waterings.This plant’s high tolerance extends to its soil, as it will be fine with most well-draining potting mixes. It prefers a pot with drainage holes.",
        "propogate": "Propagation can be done by carefully dividing clumps when re-potting. Be gentle with the sensitive roots, pulling them apart with your hands rather than a knife or spade, and keep two to three stems in each group. One of the trade-offs for its tolerance to a variety of conditions is slow growth, so don’t be surprised if it takes years of growth before your plant is ready to divide.",
    },
    {
        "id" : 19,
        "name": "Christmas Cactus",
        "size": "medium",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "low",
        "about": "The Christmas cactus (Schlumbergera bridgessii, or Schlumbergera × buckleyi) originated in the coastal mountains of southeastern Brazil, where its parent plant clings to shaded trees and rocks in the jungle. The leafless green stems form flat, segmented pads that grow in a cascading pattern. Under the conditions (see below), the plant may produce white, pink, or red fuchsia-like flowers multiple times a year, although it’s named for its winter-blooming habit. According to the ASPCA, the Christmas cactus is non-toxic to both dogs and cats.",
        "care": "Despite the name, in many ways you need to treat a Christmas cactus more like a tropical plant than a cactus. It is not a desert cactus, and instead thrives in conditions closer to the ones you’d provide orchids. Plant in a light-weight, free-draining soil, such as a succulent or cactus mix or African violet mix, in a pot with drainage holes. Water it thoroughly and regularly, letting the top inch of soil dry out between waterings. Fertilize every two weeks during the growing season (approximately April through September).",
        "propogate": "The Christmas cactus prefers bright, indirect light and temperatures between 60 and 70 degrees for most of the year. It can be damaged by too much direct sunlight, and needs to be kept away from drafts, heaters, ducts, and fireplaces. Although usually grown indoors, the Christmas cactus can actually survive outdoors in United States Department of Agriculture zones 9 to 11. It cannot tolerate any frost or snow and needs to be well-watered and protected from any temperature extremes.",
    },
    {
        "id" : 20,
        "name": "Cilantro",
        "size": "small",
        "difficulty": "intermediate",
        "light": "high",
        "flowering": "yes",
        "water": "medium",
        "about": "People have strong feelings about cilantro: love or sheer abhorrence, with no in-between. This aversion is perhaps genetic, and many haters report that cilantro tastes like soap. Hmmm. Well, if you’re not a cilantro hater, if you love it like I do and want to have a fresh supply right at your scissor-tips, here are some dos and don’ts for growing this most polarizing of herbs.",
        "care": "Plant cilantro in full sun and well-drained soil. Light shade is fine for locations in the South and Southwest where the sun is intense.Be mindful of cilantro’s growing season. The plants do well in cool weather— spring and fall in most places. When the weather gets warm, cilantro will send up tall shoots that will flower, signaling that their harvest season is over.Plant cilantro in its own space so it has room to re-seed.Stagger plantings to ensure an uninterrupted harvest.Remember to fertilize every four to five harvests. Feed your edible plants and they’ll feed you.Water germinating seeds well. Plant twelve inches apart or thin seedlings to six inches apart, depending on what you’re growing from. I personally have had the best luck growing cilantro from seeds.Choose slow-bolting varieties of cilantro, such as Costa Rica, Long Standing, or Leisure for the best harvests.Pinch back young cilantro plants to encourage bushier plants.",
        "propogate": "Most people grow cilantro from seed or transplants. Growing from seed is the most reliable way to propagate cilantro, but you can also try cuttings. Cut off a healthy stem about 3 to 5 inches (8-13 cm.) long just below a node, where the leaves grow. Remove the lower leaves and place the end of the cutting in water. Let it sit in gentle, indirect sunlight where it won’t get too cold. You can also try letting the cutting grow roots in a rich starter soil.",
    },
    {
        "id" : 21,
        "name": "Coffee Plant",
        "size": "large",
        "difficulty": "intermediate",
        "light": "high",
        "flowering": "yes",
        "water": "medium",
        "about": "The coffee plant is part of the Coffea genus of plants, which includes many tropical species native to Asia and Africa. The flowering plants produce berries, which are harvested and roasted to produce coffee. Coffee plants have dark green, glossy leaves, and are quite bushy and full in their early years.",
        "care": "Coffee plants favor bright, indirect light. They don’t like direct light, which can sunburn their leaves. Stick with bright, filtered light and you’ll be okay. If you only have bright direct light, consider a sheer curtain to diffuse the light. Don’t let your coffee plant dry out all of the way. These plants love water, and need a regular watering schedule. Skipping a week or longer (eek!) will result in damage to your plant. Give it a drink when that soil is dry an inch or so from the surface, which can be easily measured by the knuckles on your fingers. One knuckle is roughly one inch. Once you get to know your plant better you’ll be able to set a watering schedule, a perfect use for your calendar on your smartphone. Remember, the more light a plant gets, the water it generally needs. ",
        "propogate": "To propagate coffee plant, you can do so from cuttings or air layers, which is a somewhat involved technique where you root branches still attached to the parent plant. The best time to take a cutting is in the early summer. Select a straight shoot that's about 8 to 10 inches long and remove all but a pair of upper leaves. Then, plant the cutting in a small pot of soilless potting mix, and keep the soil slightly moist.When you can gently tug on the plant and feel resistance, you'll know roots have formed.",
    },
    {
        "id" : 22,
        "name": "Croton",
        "size": "medium",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "no",
        "water": "medium",
        "about": "Codiaeum variegatum, or variegated croton, is an evergreen shrub in its native lands of Indonesia, Australia, Malaysia, and Pacific Ocean islands. Hundreds of cultivars sport a wide variety of leaf shapes, colors, and patterns, so you can probably find one to match your decor if you’re so inclined. The ASPCA doesn’t have an entry about croton toxicity, but other sources indicate that it’s likely toxic to dogs and cats, and people. Even broken branches or leaves produce an irritating sap that can cause eczema, and reportedly tastes terrible, fortunately discouraging further consumption. Parents with young children will probably want to skip this plant.",
        "care": "There are multiple reasons this plant’s leaves drop, which are what make this type tough to grow. The trickiest part of keeping a croton happy is watering correctly. Crotons will drop their leaves if given too much, or too little, water (or if the temperature is too low). They need their soil to be kept evenly moist, but not soggy. Don’t let the soil dry out completely before watering again, but plant in a pot with drainage, to prevent root-rot.If you need to re-pot your croton, proceed with caution. The best time to do it is mid-to-late spring. Try to use a potting soil similar to the one the plant is already in, and don’t be surprised if you see mass leaf drop a few weeks after re-potting. Lastly, to avoid potential skin irritation from its sap, be sure to wash your hands after handling the plant.These fast-growing plants need fertilizer once a month during the spring and summer growing seasons. An all-purpose houseplant fertilizer will work just fine.",
        "propogate": "Crotons can be propagated from leaf cuttings, which involves cutting a stem a few inches long, dipping the end in rooting hormone, and pushing the end into potting soil. Like adult plants, the cuttings need moist soil and warmth, and keeping the soil at between 77° to 86° F (25° to 30° C) will increase your likelihood of success.",
    },
    {
        "id" : 23,
        "name": "Dieffenbachia Plant",
        "size": "large",
        "difficulty": "easy",
        "light": "low",
        "flowering": "yes",
        "water": "medium",
        "about": "If you want to add some greenery to your space but don’t want to spend more than five minutes a week tending to your houseplants, get yourself a couple of dieffenbachias. They’re some of the most recognized and widely available houseplants, and they also happen to be really easy to keep alive. Put them in your bedroom and you can almost forget about ’em.",
        "care": "Watering is pretty straightforward with dieffenbachias: keep it consistent and don’t over do it. Always make sure the soil is dry a few inches down before watering. Dieffenbachias don’t like soggy soil, so it’s best to err on the side of caution and let them dry out a bit if you’re unsure. It’s a good idea to fertilize dieffenbachias at least a few times per year, up to once per month, to encourage new growth. Use a liquid houseplant fertilizer applied according to the package instructions.",
        "propogate": "Simply cut 4-6″ inches long stem sections and remove the leaves. Pour a glass of water and place the dieffenbachia cuttings into it. You can change the water every few days or so.Keep the jar in a bright and warm spot but out of direct sunlight as that can shrivel the plant. Once the new roots form in a few weeks, transplant each cutting into a 4″ inch pot filled with peat-based, moist, and well-drained potting mix. Make sure to transplant right when a few roots have formed. If you let the roots grow any longer, it’ll be harder to transplant the stems.",
    },
    {
        "id" : 24,
        "name": "Dracaena",
        "size": "medium",
        "difficulty": "easy",
        "light": "low",
        "flowering": "no",
        "water": "medium",
        "about": "It’s hard to go wrong with low-maintenance dracaena plants. Their spiky, tropical foliage comes in a variety of colors, shapes, and patterns, and they even help purify the air, so it’s no wonder that they’re a popular choice for homes and public spaces. Here’s what you need to know about how to keep your dracaena healthy and happy.",
        "care": "As with most houseplants, the biggest danger is root rot from overwatering and/or lack of drainage. To prevent this, plant in a pot with drain holes, in standard well-draining potting mix, and allow to dry slightly between waterings. Water less often in fall and winter than during the growing seasons of spring and summer. Fertilize monthly during the spring and summer with standard liquid plant food.Dracaena is reportedly sensitive to excess salts and fluoride, especially the soil-free lucky bamboo version. If yellowing and browning of tips develop, you can try flushing the soil well, then watering with rainwater or distilled water.",
        "propogate": "Cuttings, like trimmed tops from plants that have gotten too tall or leggy, can easily be rooted in water, but it may take several months. Once roots have developed to at least an inch long, pot as described above. Multiple cuttings of different heights can be planted in the same pot for a bushy effect. Some people have also reported successfully growing cuttings by simply laying them on the soil, keeping the soil moist, and waiting for roots to grow.",
    },
    {
        "id" : 25,
        "name": "Echeveria",
        "size": "small",
        "difficulty": "easy",
        "light": "high",
        "flowering": "yes",
        "water": "low",
        "about": "Echieveria is the kind of succulent that makes you do a double take in a plant shop because of its gorgeous pastel-tinged colors and shapes. Here’s some extra good news: The showstopper is also incredibly low-maintenance. In fact, it’s so drought-tolerant, you can nearly set it on your windowsill or a sunny tabletop and forget about it—although, with its rose-like appearance, forgetting about it might be a hard thing to do.",
        "care": "As with all succulents, be careful not to overwater your Echeveria. Instead, only water when the top several inches of soil are dry to the touch. Make sure the water hits the top of the soil, not the leaves. You should also have a proper drainage system in place, whether that’s well-draining potting soil or gravel that breaks up the flow of water. ",
        "propogate": "Echeveria is often referred to as “hens and chicks” due to how easily it propagates. Echeveria naturally produce little “chicks” next to the mother “hen” rosette. While it can multiply on its own, it’s also relatively easy for you to make happen.",
    },
    {
        "id" : 26,
        "name": "Elephant Ear",
        "size": "large",
        "difficulty": "intermediate",
        "light": "medium",
        "flowering": "no",
        "water": "high",
        "about": "Elephant ears belong to two related groups of plants, Colocasia and Alocasia. Both types can be grown in the garden or as houseplants, though colocasias are more often planted outdoors (they’re generally larger) and alocasias are a bit more common as houseplants.You can’t expect your elephant ear plant to grow as large indoors as it would outside, but that’s probably a good thing considering a single leaf can grow to be two feet wide, and stems can reach five or more feet, depending on the variety. Whether you’re planting elephant ears in a pot or a garden bed, they’re a lot of fun to grow.",
        "care": "Elephant ears grow from tubers. If you plant them outdoors in most parts of the United States, you’ll need to dig them up each fall because they won’t survive the cold.For indoor growing, plant the tuber in a large pot (14- to 20-inches), and get an extra large one if you want your plant to become truly monstrous. Fill the pot about three-quarters of the way with potting soil and then nestle the tuber in the center with the root side down. Finish filling the pot with the soil; the tuber should be about eight inches deep.",
        "propogate": "Propagation through seed isn't a common method observed and practiced for propagation by Gardners and most people. Well, it isn't impossible, though, as you can propagate through seeds if your elephant ear plant develops a seed pod.You can collect this seed pod by turning and twisting it off from the plant and then opening it carefully as it will be full of seeds and pulp. Remove the seeds carefully from the pulp and remove the pulp remaining on the seed by rinsing them off through freshwater. Make sure to collect enough seedlings.",
    },
    {
        "id" : 27,
        "name": "English Ivy",
        "size": "medium",
        "difficulty": "intermediate",
        "light": "medium",
        "flowering": "no",
        "water": "high",
        "about": "English ivy (Hedera helix) is native to most of Europe and Western Asia. You may think that the ivy that you commonly see growing on European buildings is purely decorative, but it can actually help modulate the interior temperature, keeping it cooler in the summer and warmer in the winter and protecting the walls themselves from bad weather and temperature fluctuations.So it’s basically nature’s insulation and siding rolled into one elegant vine.According to the ASPCA, English ivy is toxic to dogs and cats.",
        "care": "Plant ivy in an all-purpose potting soil in a pot with drainage. Let the top of the soil dry to the touch between waterings, and fertilize your ivy about once a month in the spring, summer, and fall. Especially in dry, winter air, it will benefit from regular misting of the foliage.",
        "propogate": "One of the easiest plants to propagate, the ivy can be propagated by anyone with a pair of scissors to take cuttings. Simply take 4 to 5 inch long cuttings of the plant, with at least 3 to 4 leaf nodes. Plant the cuttings in a moist potting mix or propagate in water",
    },
    {
        "id" : 28,
        "name": "Ficus",
        "size": "large",
        "difficulty": "advanced",
        "light": "high",
        "flowering": "no",
        "water": "high",
        "about": "Ficus plants have been making dramatic statements in homes for decades. These are the same plants that we saw in our grandparents’ homes; but, with the resurgence of large, dramatic plants in the design world, it’s not surprising that everyone and their cousin now has—or desperately wants—some kind of ficus in their living space. Like some other popular trendy plants, there’s often more than meets the eye. To be honest, a ficus can be a total beast to care for. Here’s what you need to know.",
        "care": "Ficus love bright, soft light. Not too bright because hot light scorches their leaves. Bright, indirect light can be described as light coming from an east- or south-facing window (or near to) that is obscured with a sheer blind or frosted glass. If there’s nothing fracturing the light, simply move the plant further away from the window. Remember, bright light, not hot light.Ficus are tropical plants so you really want to recreate a similar environment for them to be happy. Mist those leaves (indirectly—think applying hairspray) according to your household’s humidity level. It might be a good idea to invest in a humidifier if your house has continuously dry air.",
        "propogate": "To propagate by stem cutting, identify a 6-inch leafed sprig with at least 3 nodes and make a cut about an inch below the third node. After clipping the sprig, dip it into rooting hormone and insert it into a rooting medium or damp soil. Wait 4 to 6 weeks until roots form.",
    },
    {
        "id" : 29,
        "name": "Fiddle Leaf Fig",
        "size": "large",
        "difficulty": "advanced",
        "light": "high",
        "flowering": "no",
        "water": "high",
        "about": "Ah, the fiddle leaf fig, aka ficus lyrata/pandurata. It’s Instagram’s most popular plant, the top choice among many interior designers, and an enticing siren to first-time plant parents. True, they’re not as patient as the equally Instagram-famous rubber plant, but a little extra TLC, enough drainage, good lighting, a quick shake, and attention to detail can make all the difference. to your fiddle leaf fig.",
        "care": "Although fiddle leaf figs are acclimated to warm, humid environments, that’s not something that can easily be maintained in a home or apartment. Luckily, that’s not a huge dealbreaker for this plant. For your fiddle leaf fig to really thrive, it’ll ideally need the following conditions: Bright, filtered light. For example, a window with a sheer curtain that gets direct sunlight is perfect. Warmer climate. Fiddle leaf figs don’t do well in the cold and prefer warm, humid environments. Soil with good drainage.Place away from drafty windows or air vents that are constantly being used. Feel like going above and beyond? Place a humidifier near your fiddle leaf to amp up the humidity.",
        "propogate": "So you can use this method for both leaves and small stem cuttings. That’s because it’s pretty much the same root growth approach—the leaves have the “stem infrastructure” in them. If you’re taking a leaf, make sure you get the tiny “stem/node” that attaches the leaf to the stem. However, be warned—taking a cutting from a leaf may not yield a new plant, even if the leaf roots. It would be a fun experiment to try if you lost a leaf on the plant or if you were pruning your plant. But I ultimately recommend taking a stem cutting that has buds on it. When taking a small stem cutting, just make sure you get enough length on the stem to turn it into a plant. Remove a few of the lower leaves so you’re able to get the plant nice and rooted in water",
    },
    {
        "id" : 30,
        "name": "Fittonia",
        "size": "small",
        "difficulty": "intermediate",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "Fittonia — also known as the nerve plant, mosaic plant, or net plant — might just be the cutest little drama queen you’ve ever met. Neglect your watering routine on your fittonia and it will wilt like a coffee fiend on a caffeine fast. However, we wouldn’t go so far as to say the fittonia would be included in our list of plants that can’t be overwatered. In other words, this houseplant requires a bit more care than, say, a low-maintenance snake plant.",
        "care": "Fittonia — also known as the nerve plant, mosaic plant, or net plant — might just be the cutest little drama queen you’ve ever met. Neglect your watering routine on your fittonia and it will wilt like a coffee fiend on a caffeine fast. However, we wouldn’t go so far as to say the fittonia would be included in our list of plants that can’t be overwatered. In other words, this houseplant requires a bit more care than, say, a low-maintenance snake plant.",
        "propogate": "Cut the stem at the node (the area where the buds are) and place it in water in a bright, warm space. Alternatively, you can cut a leaf and stick that in water as well. Propagation takes anywhere from two to eight weeks. However, rooting powder can speed up that process.",
    },
    {
        "id" : 31,
        "name": "Garlic",
        "size": "small",
        "difficulty": "easy",
        "light": "high",
        "flowering": "no",
        "water": "medium",
        "about": "Garlic is the MVP of the edible plant world and can make nearly any savory dish taste better. There are festivals dedicated to it, cookbooks that wax poetic about its abilities, and garlic enthusiasts who may have tried too many culinary experiments with it. While it and many other herbs are easily accessible at nearly any grocery store, growing your own hydroponic garlic is fun, rewarding, and fairly simple.",
        "care": "These bulbs prefer moist soil, but be sure your pot is getting enough sunlight and has good drainage to help keep the water moving through. If garlic sits in too much water, it can rot or simply die. To water garlic, simply fill a container with room temperature water and gently pour it into the soil. When growing in a container indoors, garlic likes bright direct sunlight, and it will need at least six hours of it a day in order to grow properly. If your home isn’t blessed with endless sunshine and tons of open windows, that’s fine! A fluorescent bulb or growing light can be equally as useful and sometimes even more efficient.",
        "propogate": "Garlic does not produce true seed but is propagated by planting cloves, which are the small bulblets or segments making up the garlic bulb. Each bulb usually contains a dozen or more cloves; each clove is planted separately. Select only larger outer cloves of the best garlic bulbs for planting.",
    },
    {
        "id" : 32,
        "name": "Haworthia",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "low",
        "about": "Haworthia is recognizable by its pearly warts (it’s cuter to think of them as polka dots), and is commonly called zebra cactus, pearl plant, star window plant, or cushion aloe.Predominantly native to South Africa, haworthia is usually small, around 3 to 5 inches in height (although some can shoot out taller blooming spikes), and a relatively slow grower.Plus, haworthia is nontoxic to pets!",
        "care": "Watering: As with all succulents, be careful not to overwater your haworthia, and make sure it has well-draining soil. Haworthia need to be watered when their soil is completely dried out and their leaves start to curl (about every two to three weeks). In the winter, they need less water, so you can basically forget about them and just water them every other month. Light: Haworthia love bright, indirect sun. If you have a window facing south, east, or west, that’s your winner. If you want to move your haworthia outside during the summer, expose it to the sunlight a little more each day at the beginning of the season, so that it doesn’t become overexposed to the sun on its first day outside. Otherwise, its leaves will burn!",
        "propogate": "Check out this video on how to propagate your haworthia from an offset. You’ll need a well-draining pot, cactus mix (the video recommends cactus mix with pumice), and a haworthia with offsets. As the video demonstrates, you should gently pull away the offset and leave it out for 24 hours to dry. Then, pop the offset upright in a new pot and wait a week to water. The video suggests watering once a week outside in partial sun or once every two weeks if kept in bright light inside. When watering, make sure to only hit the top of the soil, not the actual plant. Repot the mother haworthia in a slightly larger pot so it can continue to grow.",
    },
    {
        "id" : 33,
        "name": "Hoya",
        "size": "medium",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "low",
        "about": "You’ve probably seen hoya eye candy all over Instagram. The evergreen perennials are known for their vines and clusters of star-shaped flowers, and are commonly called the “wax plant” because they look like their leaves have been carved from wax. You can usually find them in hanging baskets, with their vines happily overflowing.  ",
        "care": "Hoya is happiest in bright, indirect light, which is why it’s often found hanging in windows. The plant likes baskets on the smaller side so that it can be a bit rootbound. Make sure your soil has good drainage, and water it enough to keep it moist, but not wet. The waxy, thick leaves hold a lot of water, so you might not need to water it as often as you think.  ",
        "propogate": "Steinkopf says all you need to propagate a hoya is a leaf or two attached to a piece of stem. “Pin to a container of damp potting medium, and it will send out roots in a few weeks,” she says.It’s important not to forget the stem in this process. The lack of stem is why a single heart-shaped leaf of Sweetheart Hoya in a small pot will never turn into a larger vine.",
    },
    {
        "id" : 34,
        "name": "Jade Plant",
        "size": "medium",
        "difficulty": "easy",
        "light": "high",
        "flowering": "yes",
        "water": "low",
        "about": " Jade plants are cheery little succulents, fun to look at and easy to grow. With a little practice, you can even propagate them for super cute gifts. These no-fuss, slow-growing plants share the ideal growing conditions of many succulents. Here’s how to care for them…",
        "care": "While jade plants are relatively tolerant, they prefer daytime temperatures in the range of about 65 to 80 degrees and cooler nighttime temperatures. Jade plants also need bright light to avoid reaching for the sun and becoming leggy. In spring and summer, water jade plants when the top part of the soil becomes dry. Try to avoid getting the leaves wet when you water. During winter, the jade plant’s dormant time, allow the plant to become even dryer. Looking at the leaves provides a good hint about the watering needs of your jade plant: leaves that are full and glossy are those of happy plant; on the other hand, if leaves develop spots or start to fall, you’re probably not watering enough.",
        "propogate": "If you prefer to use a cutting, which will give you a bigger plant sooner, make a cut with a sterile knife or scissors as close to a leaf node as possible. Your cutting should be about 3 to 4 inches long. Remove stems from the bottom inch, let it callous over for a couple days, and dip it in rooting powder before planting the stem in soil. Cover with a sandwich bag to keep the plant from losing too much moisture, and place it in a shady, somewhat warm area. Remove the bag if condensation appears or after about a month, at which time roots should have formed. You can now gradually move your new jade plant to a sunnier location.To propagate from a leaf, cut off a leaf, let the cut callous, dust rooting powder on it, and plant it in soil. Soon, roots will take off and you’ll see baby leaves developing.",
    },
    {
        "id" : 35,
        "name": "Kalanchoe",
        "size": "medium",
        "difficulty": "easy",
        "light": "high",
        "flowering": "yes",
        "water": "low",
        "about": "So let us introduce you to kalanchoe, a succulent with vibrant, long-lasting flowers that’s as easy to care for as it is to look at. It’s a hardy succulent that grows to be about a foot tall with beautiful deep green, scalloped leaves, and clusters of tiny star-shaped flowers in bright pink, yellow, orange, red, or white. You can commonly find it in garden centers, so it shouldn’t be difficult to get your hands on one.",
        "care": "Kalanchoe is a survivor, so you shouldn’t have much trouble keeping it alive, but there are a few key things you need to know to keep your plant healthy. Follow these tips and it will bloom every winter and spring for many seasons to come!",
        "propogate": "If you have a mature kalanchoe succulent, you’ve probably seen it grow offsets to create new plants. These baby plants pop up at the tips of leaves and rely on the parent plant while they grow their own roots. However, this takes a lot of energy from the parent. It will be faster and easier on the plant to take over the propagation yourself.",
    },
    {
        "id" : 36,
        "name": "Kentia Plant",
        "size": "large",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "Originally from Australia, and now one of the most popular houseplant palm trees in the world, the kentia palm is sometimes referred to as the paradise palm.  It can withstand some neglect and tolerates dry indoor air and even low light conditions, making it the “snake plant” of palm trees.  Sometimes reaching up to 10 feet indoors, it looks great in a floor planter, and can add some height to your current plant collection. Another plus for our furry friend owners: according to the ASPCA, the kentia palm is non-toxic to cats and dogs.",
        "care": "While they are forgiving, it’s always best to aim for optimal care for any plant. The kentia palm prefers indirect sunlight, but can also thrive in low light conditions—never direct sunlight.  It would enjoy sunlight filtered through a curtain, but could also do well on a wall further away from your window as long as it is getting some light. ",
        "propogate": "Unfortunately, kentia palms do best when grown from seed, so it’s not a plant you’ll be able to propagate through a cutting or division.",
    },
    {
        "id" : 37,
        "name": "Lady Palm",
        "size": "large",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "As mentioned, the R. excelsa and the R. humilis are two different plants. With adequate care, R. excelsa will grow upwards of six feet tall in maturity. This might seem large to you, but it’s actually a midsized palm. It’s the perfect plant for a corner as the stems and foliage tend to grow in an upright fashion.",
        "care": "During the growing season (spring, summer and the beginning of fall) lady palms need thorough watering at least once a week. Be wary of overwatering. You’ll have to remember that most of this plant’s roots grow straight down to the bottom of the pot, where they soak up most of the water, so the “water when the soil is dry 1 inch deep” rule doesn’t really apply here. If you’re in doubt that it needs to be watered, wait a few days. In the winter, you will only need to water your plant once every week and a half or so. It won’t be using as much water and therefore doesn’t need to be watered quite as frequently. ",
        "propogate": "Buy viable, fresh Lady Palm seeds from a seed supplier or a reputable nursery or online.Soak these seeds in warm water for a day. It softens the hard outer shell and helps with germination.Fill the small pots or seed tray with well-draining soil. Add a mix of sand or perlite and peat moss to it.Sow the seeds about half an inch deep into the soil. Cover the seeds with a thin layer of soil. Water the soil to keep it moist but not soaking wet. Cover the seed pot or tray with a plastic wrap or bag to create a humid environment. Move this pot or tray to a spot with bright but indirect sun. Inspect the soil moisture regularly and water as required to keep the soil moist. Be judicious and do not overwater, as it can result in rot and fungal growth. In four to six weeks, the seeds will sprout and begin germinating. After the seedlings have grown some leaves, you can transplant them into individual pots filled with well-draining soil. Continue caring for the seedlings by exposing them to filtered, bright light, and keep the soil moist but not waterlogged. After the seedlings mature and grow some stems, you can transplant them into the larger containers or grow them in the growth. You need ample attention and patience to grow Lady Palm from seeds. However, if done right, it can be a rewarding process. Your Lady Palms will thrive beautifully in your garden or home with sufficient attention and care.",
    },
    {
        "id" : 38,
        "name": "Lavendar",
        "size": "medium",
        "difficulty": "intermediate",
        "light": "high",
        "flowering": "yes",
        "water": "medium",
        "about": "Lavender is native to Europe and the Mediterranean, but it can be grown in a variety of different zones and climates. It isn’t a traditional houseplant, but that doesn’t mean you can’t succeed. With enough love and attention, you’ll have a thriving, delicious-smelling lavender plant growing in your home before you know it.  ",
        "care": "Give your plant as much sunlight as you can. A south-facing window is a prime option. Pot in quick-draining soil. Lavender thrives in a well-draining, rocky medium. Try supplementing traditional potting soil with limestone. Try your hand at a smaller variety. There are many to choose from—we recommend giving French lavender a try!",
        "propogate": "Source stems from any variety of your favorite lavender.Cut a 4in. – 6in. stems from the plant using garden clippers. Remove leaves gently from the bottom 1/3 of each clipping. Fill potting soil to the top of your potting tray. Make small holes in the soil about 2-3in. deep for each stem.",
    },
    {
        "id" : 39,
        "name": "Lemon Button Fern",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "no",
        "water": "medium",
        "about": "",
        "care": "",
        "propogate": "",
    },
    {
        "id" : 40,
        "name": "Lemon Tree",
        "size": "medium",
        "difficulty": "advanced",
        "light": "high",
        "flowering": "yes",
        "water": "medium",
        "about": "Many people find that they can’t keep ferns alive, and there are many many fern varieties out there. If you haven’t been able to keep a fern alive in your home but haven’t tried a lemon button fern yet, this plant is for you. The lemon button fern (Nephrolepis cordifolia 'Duffii') is a beautiful plant, suited for both a novice and a professional collector.",
        "care": "A lemon button fern can survive in a very damp environment, but it will also be okay if you let it dry out occasionally. It’s a plant that’s easy to streamline to your other plants’ watering schedules. Whether you’re watering it more often or just once a week, it will perform for you. Mist your plant multiple times a week for good measure. There may be a few naysayers who will argue that a lemon button fern can only thrive in an indirect light situation, but I’ve successfully grown this plant in a very bright environment, a very gloomy corner, and somewhere in the middle—all over the course of a few years. That whole process simply proved to me that this plant is almost as hardy as a snake plant or ZZ plant. Of course, the one main difference is the amount of water each plant needs.",
        "propogate": "Lemon Button Ferns can be propagated through division. Try to do this in the spring, hydrating the plant the night before. Take the plant out of the container, and divide the clump by cutting through where needed with a sterilized knife. Repot your new decisions in a peat-based soil amended with a rooting hormone.",
    },
    {
        "id" : 41,
        "name": "Maidenhair Fern",
        "size": "medium",
        "difficulty": "intermediate",
        "light": "medium",
        "flowering": "no",
        "water": "medium",
        "about": "The name maidenhair fern actually refers to the Adiantum genus of about 200 different species that grow around the world, everywhere from New Zealand to the Andes. Many varieties are especially suited to growing on rock walls around waterfalls, where the water seepage and moisture in the air keep them from drying out.Although there are species that live in a variety of conditions outdoors, I’ll be talking about the conditions that generally suit varieties commonly kept as houseplants.",
        "care": "Clay pots alone aren’t recommended because they allow the soil to dry out too quickly. And when the soil dries out, the fronds shrivel up and die immediately. This is not a plant you can be lackadaisical about watering because you also cannot let the roots sit in puddled water. The soil needs to be constantly kept moist but not soggy. I can tell you what has worked for me by killing a few and then successfully growing a few. Mine are in plastic pots, inside a cachepot. Every few days, I take the plastic pot out and thoroughly water the plant in the sink. I let the water drip out until it stops, then I put it back in the cachepot. (Ease of watering is another reason why a bathroom is an ideal location for this plant.)",
        "propogate": "When repotting, use a clean knife or sharp spade to divide the roots into pieces containing a minimum of two to three healthy fronds each. Plant each section in its own pot, and water well.",
    },
    {
        "id" : 42,
        "name": "Maranta",
        "size": "medium",
        "difficulty": "advanced",
        "light": "medium",
        "flowering": "yes",
        "water": "high",
        "about": "Sure, prayer plants boast beautiful, broad leaves with variegated shades of green, but here’s what’s really special about them: At dusk, the leaves fold together as if in prayer. They open again with the morning light, sometimes with a faint rustle. Prayer plants (also called Maranta) require specific care, but when they receive it, they are happy and showy additions to your plant collection.",
        "care": "Prayer plants’ water preferences hearken back to their native conditions in Brazil, Asia, and Africa. They like to be kept evenly moist and just barely damp to the touch. Do not let the soil get too dry between waterings. Prayer plants also appreciate being watered with warm water. Slow down watering a bit during dormant winter months.",
        "propogate": "Prune your plants in order to keep their pleasant, bushy appearance. In the fall, cut back older leaves. Use sharp, clean pruning shears.Prayer plants are also easy to propagate through division when you repot them in the spring. In addition, you can propagate prayer plants through cuttings. Gardening Know How describes the technique:",
    },
    {
        "id" : 43,
        "name": "Mint",
        "size": "small",
        "difficulty": "easy",
        "light": "high",
        "flowering": "yes",
        "water": "medium",
        "about": "Mint is fragrant, fast-growing, green, and compliments fruits, vegetables, and meats. It’s also its own ice cream flavor. So what’s not to love about mint? If you’ve ever grown the herb, you know where I’m going with this, but if you haven’t and are interested: read on for the dos and don’ts of successfully growing mint in your home garden or in a container.",
        "care": "Like cilantro and basil, mint is one of the easiest herbs to grow; however, its roots, which are called “runners,” are incredibly invasive: they quickly grow, sprouting new leaves and new plants as they go. Mint will overtake a flower bed or garden in no time if you’re not careful.",
        "propogate": "Flowering takes a lot of energy, and a stem that hasn’t flowered yet will be able to put its energy into growing new roots instead of flowers.Take cuttings that are 3-5 inches long so that there is plenty of area on the stem for roots to grow. Longer stems are easier to propagate than short ones since there will be more places for roots to grow.Mint cuttings will start to wilt very quickly after removing them from the plant, and you definitely don’t want them to dry out before propagating them.So be sure to prepare the soil or your vase of water before taking cuttings. That way you can get them into the dirt or water quickly before they start wilting.",
    },
    {
        "id" : 44,
        "name": "Money Tree",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "no",
        "water": "medium",
        "about": "If you saw a money tree, or Pachira aquatica, in its native habitat of Central and South American swamps, you probably wouldn’t recognize it. The tree can grow up to 60 feet tall (versus a max of 3 to 6 feet indoors), and that ubiquitous braided trunk isn’t a natural feature. When grown in a nursery, the supple young, green trunks are slowly braided by cultivators before they harden and turn woody.",
        "care": "To avoid root rot, a money tree needs sandy, peat-moss-based soil and a pot with good drainage. Although it likes humidity in general, you should let its soil dry out between watering. A good schedule for most environments is to water when the top 2-4 inches of soil are dry. Water thoroughly until water flows out the pot’s drainage holes, and pour out the excess from the tray so that the roots don’t sit in water.During the growing season, fertilize once a month with a liquid plant food at half strength, but skip fertilizer in the winter.",
        "propogate": "With clean pruning shears, cut off the tip of a stem with at least two leaf nodes. Dip the cut end in hormone rooting powder, and place in a standard potting mix. Keep the soil moist with regular misting until the cutting roots, in approximately 4 weeks.",
    },
    {
        "id" : 45,
        "name": "Monstera Adansonii",
        "size": "medium",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "no",
        "water": "medium",
        "about": "By now, you’re probably well acquainted with Monstera deliciosa—that gigantic, sculptural houseplant straight out of Mad Men that currently appears in roughly 75 percent of all design bloggers’ Instagram posts. It’s adored equally for being easy to grow and looking good next to a mid-century sofa. But have you met its cousin, Monstera adansonii? For all its delicate beauty, growing this lacy plant is fairly straightforward.",
        "care": "Plant it in a pot with drainage holes using a standard potting soil that contains peat. (Peat helps to trap moisture without becoming waterlogged.) It will look best in a hanging basket or in a pot on a high shelf or somewhere else where its trailing vines can be shown off to advantage without getting in the way.",
        "propogate": "It’s easy to grow baby Monstera adansonii from your current plant. Snip off a section of vine that includes at least two nodes (those knobby bits where the leaves form). Set the vine in a glass of water until roots form and then plant the cutting in soil. You’ll have a brand new plant to give to a friend or trade at a plant swap.",
    },
    {
        "id" : 46,
        "name": "Monstera Deliciosa",
        "size": "medium",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "",
        "care": "1. Plant in peaty, well-draining soil in a pot with drainage holes. Monstera deliciosa is a climber in its natural habitat, using its aerial roots to cling to large trees, so you should provide it with moss-covered support sticks or a trellis.2. If its aerial roots get unruly you can trim them, but it’s best to just tuck them back into the pot. They’re not the type of roots that damage walls or surfaces. Water when the top quarter-to-third of the soil feels dry to the touch. Standard liquid plant fertilizer can be applied about once a month during the spring and summer growing season.3. Keep leaves clean and dust-free by washing with a cloth dipped in a solution of a drop of dishwashing detergent in a few cups of water. Though it’s not required, the plant also appreciates regular misting of its leaves.4. When Monstera deliciosa outgrows its current pot (about every two years), transplant to a new pot a few inches larger in diameter and depth than the old one.",
        "propogate": "First, find a leaf growing out of a stem, with a short aerial root below it. Just below that root, cut a small notch about one third of the stem’s diameter. Then, wrap the notch, aerial root, and the node where the leaf joins the stem with a 1-2 inch layer of sphagnum moss. Finally moisten the moss and wrap it in plastic. You’ll need to be able to open the plastic to check on the root development, so secure it with twist ties. Keep the moss moist until roots develop, then cut the stem, and pot your new plant in soil.",
    },
    {
        "id" : 47,
        "name": "Moss",
        "size": "small",
        "difficulty": "intermediate",
        "light": "medium",
        "flowering": "no",
        "water": "high",
        "about": "Though moss could be associated with the words ‘dilapidated’ or ‘swampy’, moss is actually very healthy vegetation in that it has no known pests or diseases. It’s also extremely forgiving and requires little to no maintenance. It’s soft on your feet if used as a groundcover, stays green throughout colder months, and is really easy to propagate.",
        "care": " 1. Measure two cups of water and two cups of buttermilk. 2. Pour both into the blender. 3. Top with moss to fill the blender. 4. Blend until you have a milkshake consistency. You want the existing moss to separate. 5. Paint or pour the mixture on rocks, fences, foundations, bricks, ceramic pots, trees or wherever you’d like to see moss grow. You can get creative and draw pictures if you’d like or write things if you’re feeling fancy.",
        "propogate": "Not all plants can reproduce from any part of their body, but moss is a great example of a plant with this unique ability. As a moss plant is ripped up, each new piece can grow into a new plant. This allows moss to propagate over a large space (like a forest, or a lawn) even with their slow growth.",
    },
    {
        "id" : 48,
        "name": "Olive Tree",
        "size": "medium",
        "difficulty": "advanced",
        "light": "high",
        "flowering": "yes",
        "water": "medium",
        "about": "Given the current craze for houseplants, it’s hard to imagine there’s any un-trod territory there, and yet — I was totally surprised to realize that you can grow an olive tree inside. Of course, once I started looking for them, I began to see olive trees everywhere and wondered why I didn’t notice them before.",
        "care": "Olive trees like soil that drains easily, like a cactus mix. Placing a inch or two of styrofoam, gravel, or any other kind of filler on the bottom of the pot will keep the soil well-drained. (And of course, make sure your container has plenty of drainage holes.) Unfortunately for those of us living in cavelike spaces, the olive tree, like most fruit trees, prefers full sun (at least six hours a day). A sunny, south-facing window is ideal.",
        "propogate": "You can propagate olive trees from cuttings, closely resembling the parent tree in genetic material, size, and olive fruit production. Choose the cutting you prefer: stem or root cutting; take it in the summer or late in autumn, plant it with rooting hormone, and wait a couple of months until you see new growth.",
    },
    {
        "id" : 49,
        "name": "Orchid",
        "size": "medium",
        "difficulty": "intermediate",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "Depending on who you talk to or what you read, you’ll hear that orchids are both simple joys to grow and maddeningly fussy. As with most things, the truth lies somewhere in between. Yeah, they’re a bit delicate, but newbie gardeners can learn to care for them without much trouble. Really, they’re no harder to care for than most houseplants, once you understand their quirks. Here’s what you need to know.",
        "care": "Watering is the trickiest part of caring for orchids because they’re extremely susceptible to overwatering. Too much moisture will cause your orchid to quickly succumb to root rot. Using ice cubes to water once per week is an easy way to prevent overwatering, but the preferred method is to dose the potting mix using the faucet for 15 seconds followed by 15 minutes of draining to ensure all excess water runs out. You should feel the potting mix before watering—it should dry out almost completely between waterings. The pot should also feel lighter when you lift it. Watering frequency will depend on humidity and temperature, but once per week or every other week will work in most cases. Orchids won’t bloom if they don’t get enough light, so a bright, sunny window is very important. If you notice the leaves burning, the light is too harsh, but in general you should give them as much light as possible, especially in winter. If the foliage looks dark green and limp, the plant definitely needs more light. Healthy leaves will be light green, upright, and sturdy.",
        "propogate": "Like most plants, orchids are able to reproduce themselves in two different ways; the one way sexually by seed, and the other asexually by vegetative propagation. For the beginner, vegetative propagation is commonly used to build up one's orchid collection. Vegetative propagation can be accomplished in three ways; that is, by division, back bulbs and offshoots. The technique of each differs primarily in the means of producing the new individual and in the early care.",
    },
    {
        "id" : 50,
        "name": "Oregano",
        "size": "small",
        "difficulty": "easy",
        "light": "high",
        "flowering": "yes",
        "water": "medium",
        "about": "Oregano brings delicious flavor to our favorite foods—and it’s also the perfect addition to any windowsill herb garden. Oregano is a hardy plant that will thrive with a little bit of attention and plenty of sunlight. That being said, it’s still possibly to be led astray!",
        "care": "Try different varieties. Greek oregano has the zestiest flavor, but both Mexican and Italian varieties are tasty, too. Fertilize. To promote growth, use a liquid or pellet fertilizer. Don’t forget to follow the directions on the bottle. No one likes chemical burns on their herbs. Start from seed. It’s an adventure to start any herb from seed, and now is just the time to do it. Follow the directions on the back of the seed packet. Harvest your bounty. Cut off a stem and then strip the leaves. Use fresh or dry for later. Rotate the pot with every watering to ensure even growth. Look out for bugs and pests. Check under the leaves and on top of the soil, just in case.",
        "propogate": "Change the water every two to three days, if you choose that option. If planting in a soilless mix, make sure you keep it moist. Place the cuttings in an area with bright light, but not in direct sun. Cuttings will be ready to transplant in four to five weeks, when the roots are about an inch long.",
    },
    {
        "id" : 51,
        "name": "Oxalis",
        "size": "small",
        "difficulty": "intermediate",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "Unfortunately for the black thumbs of the world, those darling houseplants of the design blog world are not typically beloved for their ease of care. They’re showstoppers, to be sure, with dramatic leaves and bright blooms, but rarely are they dogged survivors. (We’re looking at you fiddle-leaf fig!)",
        "care": "Caring for the shamrock plant is straightforward: put it in a sunny window and water when the top inch of soil gets dry, typically only every other week. When you water, rotate the pot so the opposite side faces the window to ensure that the foliage grows evenly on all sides. Feed it occasionally with a liquid houseplant fertilizer like Neptune’s Harvest Organic Fish and Seaweed Fertilizer. Do this reliably and you’ll have a happy shamrock plant for years to come!",
        "propogate": "Propagating oxalis doesn't require much effort; the plant is a prolific self-seeder. However, gardeners who want to propagate the plants can do so by division or seed. Division: The plant's dormant period (usually summer) is the best time to divide oxalis plants. Lift the plant from the ground using a shovel or trowel. Brush away some of the soil and use your hands to gently separate the rhizomes or bulbs, being careful not to damage them. Replant the divisions immediately and water. Seed: The seeds of most oxalis plants germinate quickly, usually in 7–14 days. In early spring, prepare a bed or container with well-draining soil and space the seeds about an inch apart. Cover them with a thin 1/8 to 1/4 inch of soil and water them. After they germinate, thin the seedlings to the recommended spacing for the species. If you are starting the seeds indoors, cover the container with a plastic bag and put it in a brightly lit area. Remove the bag when you see growth.",
    },
    {
        "id" : 52,
        "name": "Parlor Palm",
        "size": "medium",
        "difficulty": "easy",
        "light": "low",
        "flowering": "no",
        "water": "medium",
        "about": "Got a corner that needs filling or a sunroom that’s begging for a touch of green? Then it’s time you got acquainted with the parlor palm (Chamaedorea elegans), sometimes also called Neanthe bella palm or Victorian parlor palm for its popularity in Victorian-era sitting rooms. Its tropical, slender fronds grow more or less upright, reaching about four feet in height indoors and making the parlor palm the perfect occupant for a floor planter. The best part? Caring for it is really simple. Here’s how.",
        "care": "Water: Like most houseplants, parlor palms like damp (but not wet or soggy) soil. Stick your index finger in the pot down to your second knuckle. If it feels damp, don’t water yet. If it’s dry, add water until it flows out of the drainage holes in the bottom of the pot. Houseplant care site Epic Gardening recommends watering in a circle around the base of the plant to prevent dry spots in the soil, which can cause the plant to drop fronds. Light and location: Parlor palms need bright light, but not too much of it. Direct sun leads to wilting and overly dry soil, but light that’s too low will stunt growth. Epic Gardening offers this handy tip: If you parlor palm casts a shadow, it’s getting enough light. ",
        "propogate": "You should only attempt this if you have a mature, healthy plant that has several stems. To divide your parlor palm, identify a stem that has its own separate root system. You’ll probably need to remove the entire plant from its pot and get your hands dirty to do this. As carefully as you can, separate that section from the rest of the mother plant, untangling any roots with your hands. If you cannot separate some of the tangled roots, use a clean, sharp knife to cut them away from each other, but keep as many roots intact as possible. Plant the section you’ve separated into an appropriately sized pot that has good drainage, and give it a good watering. Keep in mind, you might have to provide the newly planted stem with some support while it adjusts if it won’t stay upright.",
    },
    {
        "id" : 53,
        "name": "Peace Lily",
        "size": "medium",
        "difficulty": "intermediate",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "Peace lilies are vibrant and lovely, with verdant leaves that grace any indoor space with a touch of life. They’re also on NASA’s list of top air-cleaning plants. The really great news, though, is that peace lilies are easy to care for. With these tips, you can enjoy them for both their aesthetic and function for years to come.",
        "care": "Peace lilies are more tolerant of under-watering than over-watering. Keep plants evenly moist by watering when soil feels dry to the touch. Take care not to over-water. If your tap water has a lot of chlorine, leave it out overnight to allow the chlorine to evaporate. Peace lily leaves also enjoy a good misting, which you can do when you water throughout the summer. Watering is another area in which your peace lily will communicate with you: If leaves begin to droop, it’s time to water and your plant won’t be any worse for the little bit of wear. While peace lilies can do fine with fertilization only once or twice a year, regular fertilization in spring and summer will encourage blooms. Peace lilies are sensitive to chemical fertilizers, so use an organic general houseplant fertilizer at one-quarter to one-half the recommended strength.",
        "propogate": "Once roots begin to show above the soil, it’s time to re-pot your peace lily. This usually occurs about every year or two. Re-pot into a container that is about two inches bigger in diameter than the current pot. Re-potting is a good time to divide your plant. Crowns, areas where clusters of about two new leaves are growing, are a good place to divide your plant, but some people just separate roots anywhere to multiply their plant. Use soil from the old pot for the new plant so that it isn’t shocked. For smaller transplants, don’t use a pot that’s too big. Cozy roots encourage blooms.",
    },
    {
        "id" : 54,
        "name": "Pencil Cactus",
        "size": "medium",
        "difficulty": "easy",
        "light": "high",
        "flowering": "no",
        "water": "low",
        "about": "In reality, pencil cactus (Euphorbia tirucalli) is a succulent native to Africa and a member of the spurge family of plants rather than the cactus family, as its name implies. Its stark shoots may be tipped in orange or pink in on new growth, adding to the plant’s visual interest. If you have a room with a lot of bright sun, it’s a relatively easy houseplant to grow and, given a big enough pot, may grow as high as your ceiling.",
        "care": "Succulents store water in their fleshy stems and leaves, so you usually don’t need to water them as often as you would other houseplants. Water about once every two to three weeks during spring and summer but stop watering completely during the winter months. Bright sunlight is extremely important for growing pencil cacti. Keep it near a south-facing window and try to keep it as warm as possible. Pencil cactus is native to Africa and prefers temperatures above 65 degrees Fahrenheit all year round. You can move the plant outdoors, or to a screened in patio in the summer if you like.",
        "propogate": "Before you begin, put on safety goggles, gloves, long sleeves and other protective gear to protect your eyes and skin from the milky sap, which can cause temporary blindness, skin irritation and, in sensitive individuals, breathing problems. If ingested, the sap and all parts of the plant may result in digestive issues, including vomiting and diarrhea. Also sterilize your cutting tools by wiping the blades with rubbing alcohol. Avoid using chlorine bleach solutions; the bleach pits the metal blades of your tools.",
    },
    {
        "id" : 55,
        "name": "Peperomia",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "low",
        "about": "If you live in a small-efficiency apartment, you probably don’t have the space for a showy, sprawling monstera or a towering ficus. You need something petite that can comfortably sit on an end table or windowsill. And unless you’ve been fortunate enough to find an apartment with an abundance of natural light, you probably need something that can survive in a sliver of sun. You need a peperomia.",
        "care": "Peperomias hold water in their thick succulent-like leaves and stems, so they’ll be perfectly happy if you abandon them for a few weeks of vacation. In fact, they prefer the soil to dry out in between waterings, so as a general rule you can expect to water them only every other week.Peperomias do well in moderate light to partial shade. They can tolerate low light as well, though the plant won’t be as hardy and the beautiful look of the foliage may suffer.",
        "propogate": "1. Take Stem Cuttings: Using a pair of clean pruning shears or scissors, take a stem cutting from your peperomia plant, ensuring the stem has a leaf on it. 2. Place Cuttings in Water: Fill a small vase or jar with water and place the cutting in the water. The leaf should remain above the surface. Put the container in a location that receives bright, indirect light, and refresh the water once a week. 3. Transfer to Soil Once New Leaves Have Sprouted: Roots will begin to grow within the first two weeks, however, it’s best to wait until new leaves have begun to sprout before planting the cutting in soil. Prepare a small container with well-draining potting soil and plant the rooted stem cutting, watering thoroughly after planting. Keep the soil evenly moist for the first week to help the roots acclimate.",
    },
    {
        "id" : 56,
        "name": "Philodendron",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "no",
        "water": "low",
        "about": "If there were ever a plant that’s perfect for people who are terrible with plants, it’s the sweetheart or heartleaf philodendron. Not only are they easy to keep healthy (seriously, they’re harder to kill than to keep alive), but they come in a variety of beautiful shades and can be kept as cheerful, bushy plants or graceful trailers. Here’s everything you need to know about caring for them.",
        "care": "Philodendrons may be grown in soil or just in water. Plants that live in soil should be watered when half of the soil is dry. As with most plants, yellow leaves indicate over-watering, and brown leaves indicate under-watering. You can tell when a philodendron needs water because its leaves will appear wilted. When watered, the plant will reward you with a perky appearance. Honestly, I know from personal experience that philodendrons will survive for years without fertilization. However, they are fast-growing plants and should be fertilized monthly with a half-strength solution of houseplant food in the spring and summer and every other month in fall and winter. Alternately, fertilize every three to four months. Watch your plant because you should only offer fertilizer when it is actively producing new leaves.",
        "propogate": "One of the most fun things about philodendrons (besides the whole staying alive thing) is how easy they are to propagate. Simply cut or pinch off a branch, making sure at least a couple of nodes are present (take leaves off your cutting if you need to expose additional nodes).You can put the cutting directly into water or soil and it’ll begin to grow. I have many friends who have my philodendrons’ plant babies.",
    },
    {
        "id" : 57,
        "name": "Pilea Plant",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "low",
        "about": "The Chinese money plant, also known as the missionary plant, lefse plant, pancake plant, UFO plant, or just pilea (short for its scientific name of Pilea peperomioides) is originally from the southwestern Yunnan province of China.Popular lore maintains that a Norwegian missionary, Agnar Espegren, took cuttings home with him in the 1940s, and shared them with friends and family. Those plants were spread throughout Scandinavia and eventually the world, as people passed cutting between friends.",
        "care": "The Chinese money plant prefers well-draining potting soil, and a pot with drainage holes is necessary. The soil needs to mostly dry out between waterings, with more watering required in warmer, sunnier weather. If the leaves start to look slightly droopy, that’s a sign that the plant needs water.",
        "propogate": "Part of the reason that this plant has spread so far without being widely sold commercially is that it is fairly easy to propagate. A happy plant will eventually send plantlets up through the soil, which you can separate from the mother plant. Follow the stem about an inch under the soil, and use a clean, sharp knife to cut the baby plant free.",
    },
    {
        "id" : 58,
        "name": "Ponytail Palm",
        "size": "medium",
        "difficulty": "easy",
        "light": "high",
        "flowering": "no",
        "water": "low",
        "about": "Don’t let the name mislead you: ponytail palms aren’t actually palms at all and are more closely related to lilies but need the kind of care you’d give a cactus or succulent. Maybe it’s less confusing to stick with the scientific name of this native of southeastern Mexico, Beaucarnea recurvata, or one of the other common names, elephant-foot plant or bottle plant.While ponytail palms can reach heights of 20 feet or more outdoors, they are also often grown as a bonsai specimen. They may produce flower stalks in the summer when grown outdoors. Under normal conditions indoors, though, they probably won’t flower or reach more than about 3 feet tall.The ASPCA says that the ponytail palm is non-toxic to dogs and cats (and horses, if you happen to be keeping one of those in your house).",
        "care": "Care for this plant like you would a cactus or succulent, planting it in cactus or succulent soil in a container with drainage. You may be tempted to give this plant’s browning on the edges of the leaves.Fertilize once a month with a cactus fertilizer in the winter, and then, when new growth starts to appear in the spring, fertilize every one to two weeks throughout the spring and summer growing season.",
        "propogate": "Ponytail palms can be propagated from seed, but a more practical way to propagate them is to wait for a plant to produce a “pup,” which you can eventually separate from the parent plant. Wait until it is developing roots, then cut it away from the parent with a clean knife and put it in its own pot. Keep the soil moist to help the young plant get enough water while it further develops its own root system.",
    },
    {
        "id" : 59,
        "name": "Pothos",
        "size": "small",
        "difficulty": "easy",
        "light": "low",
        "flowering": "no",
        "water": "low",
        "about": "A care guide for pothos plants almost seems redundant because pothos are so very easy to keep alive. Seriously, if you only water them when they start to look wilty, you’ll have them for years. However, if you want to take the best care of them, so they’re the happiest and healthiest they can be, here are our best tips.",
        "care": "Pothos do well in a wide variety of light conditions and are, therefore, an excellent option for even low-light homes. In fact, try to avoid direct sunlight. Interesting fact, courtesy of Gardening Know How: a variegated pothos placed in low-light conditions may lose some of its white color because only the green part of the leaf can absorb light.On the other hand, if you notice that your pothos’ leaves look paler than usual, that’s a sign that your plant is getting too much light.",
        "propogate": " 1.Take a cutting of your pothos. Use a sharp knife or scissors to cut off a piece of plant from the end of the original plant. If you have a very long stem, you can cut it into a few pieces to root separately. Just make sure every section retains a few leaves and nodes, which is where the leaf attaches to the stem. Side note: The aerial root is that little brown bumpy thing along the stem; it’s what helps the plant climb when it’s growing in the wild, and it’s also where new roots may form when you’re propagating it. 2.Place the cuttings in water. Put the cut ends of the stems in a glass of water, making sure no leaves are submerged but that the node and aerial root are under water. Place the glass in a warm-ish room in bright, indirect light (not direct sunlight). Change the water every few days so microbes don’t affect growth. 3.Pot your rooted cutting. When they’re a few inches long, place your newly-rooted plant in fresh potting soil. Use a chopstick to make a hole in the soil, pop your cutting in, and press the soil around it. You can put multiple cuttings in the pot to make a full plant instantly. Keep the soil lightly moist (not soggy) the first few weeks, and keep the pot in bright indirect light. Remember: Not all cuttings will survive the transition from water to soil (that’s just nature!), so don’t feel bad if you have a few fails.",
    },
    {
        "id" : 60,
        "name": "Rosemary",
        "size": "small",
        "difficulty": "easy",
        "light": "high",
        "flowering": "yes",
        "water": "medium",
        "about": "Rosemary is native to the Mediterranean, and can be an outdoor perennial in zones 7 through 10—in the U.S., that includes California and the Southeast. Rosemary is an evergreen that can be grown from seed or from cuttings.To use rosemary in cooking, simply use a pair of pruning shears or scissors to snip off a branch; you can use it fresh or dry it for later use.",
        "care": "Rosemary needs a ton of light, both indoors and outdoors. When growing it inside, it needs as much bright, direct light as you can give it. Put it in your best, bright, sunny window for the best results. If you plant your rosemary in a terracotta, there’s a slim possibility that you could over water it. If you have it planted in some other container, your chances increase. Only water your rosemary when the soil has completely dried out. This could be a wide span of time, even up to two or three weeks in-between waterings.",
        "propogate": "To propagate rosemary from cuttings: 1.Take fresh cuttings from the mother plant. 2.Remove the lower leaves. 3.Bury the bare stem in moist growing medium or place in water in a warm location (room temperature) with indirect light until roots have formed. 4.When roots are an inch (2.5 cm) or longer, plant in flower pot or ground.",
    },
    {
        "id" : 61,
        "name": "Rubber Plant",
        "size": "medium",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "no",
        "water": "medium",
        "about": "Rubber trees, formally ficus elastica, can be enjoyed as either medium-sized house plants or grown to become focal point, beautiful indoor trees. If you’re patient enough to grow your own, plants that start out younger when you buy them adapt better to indoor living than starting with a more mature plant. They can grow to impressive heights within a few years, especially if you put the plants outside during the summer. Keeping the plants in small pots will restrict their growth, if you want to keep them smaller.",
        "care": "Rubber plants don’t like to sit in water, so a well-draining soil is important. House Plant Expert suggests, in particular, that a “well-draining and well-aerated potting soil is needed. 1 part peat, 1 part pine bark and 1 part coarse sand (or perlite) is a good mix.” Rubber plants like bright light and a lot of it, but not direct sunlight. A sunny spot shielded by a sheer curtain is often perfect for rubber plants. You can tell if your rubber plant needs more light if it becomes leggy, its leaves lose their luster, and lower leaves fall off.",
        "propogate": "Once your friends and family see how gorgeous your rubber plant is, they’ll probably want one of their own. Although it doesn’t always work perfectly, rubber plants are one of those plants that you can just hack a piece from and stick in soil and they can grow. Allowing the sap to dry, dipping the cutting in rooting medium, and adding a heating pad under the pot with the cutting in it can increase your chances of success.You can also air layer, which Gardening Know How explains: “Another method, called air layering, is where you make a cut in a healthy rubber tree houseplant, put a toothpick in the hole, then pack damp moss around the cut. After that, you wrap it with plastic wrap to keep the moisture level higher. Once roots begin to appear, cut the branch off and plant.”",
    },
    {
        "id" : 62,
        "name": "Snake Plant",
        "size": "medium",
        "difficulty": "easy",
        "light": "low",
        "flowering": "no",
        "water": "low",
        "about": "Snake plants, also known as mother-in-law’s tongue or sansevieria, have become increasingly popular, and rightly so. With their striking lines and hardiness, snake plants are the houseplants even black thumbs can keep alive. They also act as air purifiers to improve your home’s air quality. Here’s how to keep them happiest.",
        "care": "Snake plants do well when you almost forget about them. Allow soil to dry between waterings and take extra special care not to overwater in winter. Try to avoid getting leaves wet when you water. Place your snake plants in indirect light (although they are tolerant of a variety of light conditions) and fertilize during the growing season with all-purpose plant food.",
        "propogate": "Snake plants produce rhizomes and are easily divided. Although this can be done any time, spring is best. Your newly propagated plants will also grow faster as summer is the growing season.",
    },
    {
        "id" : 63,
        "name": "Spider Plant",
        "size": "medium",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "no",
        "water": "medium",
        "about": "When it comes to nicknames, the spider plant (or Chlorophytum comosum) is only really rivaled by the monstera deliciosa. Ribbon plant, St. Bernard’s lily, spider ivy, and hen and chickens are just a few of the monikers the spider plant has gotten over the years. Like pothos, spider plants are known for their ease of care, which makes them great for first-time plant owners and those who usually opt for faux plants.",
        "care": "Spider plants can be grown outside in zones 9 to 11, where they prefer light shade and well-draining soil. But indoors, they really aren’t low-light plants: They thrive in lots of indirect light, between 55 and 80 degrees F. Spider plants also love humidity, so the perfect spot for them is near a sunny window in a steamy bathroom. But as long as they have access to some sunlight, they’re relatively tolerant to many conditions. If the temperatures are right, a summer vacation outdoors in the shade can help an indoor spider plant put on some growth. Spider plants are known to be impossible to kill, and while they don’t need much attention, they’re not invincible. Overwatering spider plants is the most common reason they die, so be sure to note when you last watered your plant to avoid this.",
        "propogate": "The most obvious and easiest way to propagate a spider plant is by taking the plantlets that form at the end of the offshoots. Some of these plantlets even grow their first roots while still hanging from the mother plant. Once potted up in their own pot, they are quick to establish themselves.",
    },
    {
        "id" : 64,
        "name": "Staghorn Fern",
        "size": "medium",
        "difficulty": "intermediate",
        "light": "medium",
        "flowering": "no",
        "water": "medium",
        "about": "Also known as elkhorn ferns, staghorn ferns are members of the genus Platycerium, and they include species that hail from the temperate and tropical areas of South America, Africa, Southeast Asia, Australia, and New Guinea. Like air plants, staghorn ferns are epiphytes. They cling to trees and rocks in their natural habitat, pulling moisture and nutrients from rainfall and the air. You might think that they would stay small with such habits, but they can get truly massive, growing to several feet across and over a hundred pounds! Your home is most likely a very different environment than their native jungles, so they’ll grow slowly, and need special care indoors (see below). The ASPCA lists the common staghorn fern as non-toxic to dogs and cats much like the Lemon Button Fern. Its wall-mounted habitat means that this plant might be a good choice for you if you have one of those pets who won’t leave accessible plants alone.",
        "care": "Staghorn ferns are typically sold mounted to a wooden board or plaque. To save money, you can also buy young staghorn ferns in pots, and then mount them yourself. (I recently did this, it’s quite easy. Here’s a how-to.) Long-term, they do need to be mounted to a board, or kept wrapped in moss or coir in a basket. Watering correctly is the most important part of care for this plant. Staghorn ferns need regular misting, and soaking. Mist the entire plant, including the undersides of the fronds. The less humidity where it’s kept, the hotter the temperature, and more light it gets, the more misting it will need. The same rules apply for the frequency of watering, which is done by soaking. Place the entire fern, plant-side down, in a bucket or sink full of room-temperature water, and allow to soak until the root-ball is saturated, approximately 10 minutes. Allow the plant to drip dry, and let the root-ball dry out before watering again. Over- or under-watering can both spell doom for this plant, so start with watering once a week, and adjust as necessary. Wilting, or browning at the tips of the fronds indicates under-watering, and browning or blackening at the base of the fronds means you’re over-watering. During the spring and summer, you can fertilize with a water-soluble fertilizer monthly to help promote growth. Alternatively, you can also fertilize with worm-casings and fish emulsion during the summer months.",
        "propogate": "If you’re lucky, a large and happy staghorn fern may eventually produce plantlets at the base of the fern. After they’ve grown to at least 4 inches in diameter and developed several fronds of their own, these “pups” and their roots can be carefully separated from the mother plant with a clean knife, and mounted on a board.",
    },
    {
        "id" : 65,
        "name": "String Of Pearls Plant",
        "size": "small",
        "difficulty": "intermediate",
        "light": "high",
        "flowering": "yes",
        "water": "low",
        "about": "String of pearls (Senecio rowleyanus) is a vining, flowering succulent native to southwest Africa. Its round leaves, which look like little peas, store water; this makes the plant drought-tolerant and happy hanging in a window of your home. It can also thrive outdoors in an area with light shade. Its sister plant, String of Beads (Senecio herreianus) requires similar care. String of Pearls has round leaves, while String of Beads has teardrop-shaped leaves. Unfortunately, this plant is toxic to cats and dogs, and can even cause mild skin irritation for humans, so keep it a place that’s safely away from you and your furry friends.",
        "care": "If kept indoors, string of pearls prefer bright, indirect light—perhaps by a south-facing window or an area of your home that gets a good amount of sunlight. If they are kept outdoors, they prefer to be in a lightly shaded area in warmer months and brought indoors during the winter. As with most plants, keep your string of pearls away from air conditioners or other drafty areas. If its leaves start dropping, this might be a sign of chill.In the spring and summer months, string of pearls can take a light fertilizing once per month, but over-fertilizing can kill your plant. Discontinue this routine in the fall and winter, when plants are less focused toward growth.",
        "propogate": "String of pearls are relatively easy to propagate and have a similar process to other succulents. Carefully trim off a piece of the vine that’s around four inches long. Lay it on your potting soil and gently press the cutting into the soil, and roots will grow out from there. It may take several months for the roots to grow out, so during this time, leave it in a bright, indirect light location and mist the cutting a few times a week. After a few weeks, only water when the top of the soil is dry.",
    },
    {
        "id" : 66,
        "name": "Thyme",
        "size": "small",
        "difficulty": "easy",
        "light": "high",
        "flowering": "yes",
        "water": "medium",
        "about": "There are hundreds of varieties of thyme, and each is different. Some varieties, such as lemon and french thyme, are better suited for cooking while others like creeping thyme make great additions to garden pathways and ledges. If you’re looking for a certain flavor profile it will pay to do your research before showing up at the garden center. Though, I will admit, I’ve been known to nibble on some potential herbs while shopping, just to make sure I like them! ",
        "care": "While you’re planting up your new plant babies, remember that thyme needs room to grow, and will actually grow quite quickly. Because of this, it’s best to just put one plant per adequately sized pot. Overcrowding will cause plants to compete with each other for water and nutrients, which will lead to a crummy crop. If you’re planting your thyme outside in a garden bed, make sure the soil is a bit on the sandier side for good drainage. If you have a garden that has dense, peaty soil just add some sand while planting! If you’re creating a container garden or planting inside, pots with drainage holes are a must. Thyme will not grow well if planted in an environment where its roots are constantly wet. Your plant will rot. I’ve found that terra cotta pots are the best option for growing any kind of herb in a container. ",
        "propogate": "This little shrub-like herb may easily be divided or propagated through cuttings for supplementary plants. Propagate from root division during the spring months. Divide the little bush into smaller sections and make sure that each section has roots attached to it.",
    },
    {
        "id" : 67,
        "name": "Tradescantia",
        "size": "small",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "yes",
        "water": "medium",
        "about": "As with most plants, it’s hard to pin down and distinguish between the different types. You might know these guys by other names, like inch plants or Purple Heart. There are many different varieties, including Tradescantia fulminensis, Tradescantia zebrina, and Tradescantia albiflora. The most popular ones have green or silvery variegated leaves with purple undersides, although they can also come in pink as well.",
        "care": "Tradescantia likes bright, indirect light. They need a good amount of light; if they don’t get it, you’ll notice that their leaf markings begin to fade. Direct sun, however, will scorch their leaves (with the exception being the purple queen variety, which loves full sun).Tradescantia thrives in temperatures between 60 and 80 degrees, so they do well in typical indoor temperatures. Outdoors, they prefer a mild climate that doesn’t drop below 50 degrees. Frost will kill them.",
        "propogate": "Tradescantia is one of the types of plants that can be passed from friend to friend from pinched-off leaf cuttings, producing full-blown, trailing houseplants for a whole host of people. Propagation is also an easy and effective way to “refresh” your Tradescantia when it begins to show its age.There are a few ways to propagate your Tradescantia. You may simply pinch a branch or a few branches and submerge the cuttings in fresh soil. With regular watering, you’ll begin to see new growth shortly. You can also root your cuttings in water if you prefer. Alternately, you can lay a longer stem of an inch plant across the soil, and it will root where the nodes touch the soil. Want more plant care tips? Check out our guide here.",
    },
    {
        "id" : 68,
        "name": "Umbrella Plant",
        "size": "medium",
        "difficulty": "easy",
        "light": "low",
        "flowering": "no",
        "water": "medium",
        "about": "The common names “umbrella plant,” “schefflera,” or “octopus tree” can refer to two different, but closely-related species: Schefflera arboricola and Schefflera actinophylla. If you’re curious which one you have, generally, if the leaflets are longer than 4 or 5 inches (10-13 cm), it’s a Schefflera actinophylla: otherwise, it’s Schefflera arboricola.The photo above actually shows both: On the windowsill partially behind the leaves of the big Schefflera actinophylla, there’s a dwarf variegated Schefflera arboricola. The two species often look very similar and need virtually identical conditions indoors, so the following recommendations refer to both plants unless stated otherwise.",
        "care": "Water thoroughly when the top of the potting mix dries out, then let the soil dry before watering again. Umbrella plants are flexible about watering but more tolerant of dry soil than overwatering. They don’t like wet feet, so empty the drainage saucer after watering.Umbrella plants don’t need regular fertilizer, but for faster growth, you can give your plant a standard diluted plant fertilizer once a month during the summer. Keep the leaves dust-free by wiping them with a damp cloth or sponge.A mature tree, like the one pictured in the lead image, may need to be supported with a stake. Schefflera that get too big or leggy can be pruned back. Pinch growing tips to encourage a fuller, bushier plant.",
        "propogate": "To propagate, clip a stem near the base of the plant with clean shears. Dip the end in rooting hormone, then place it in potting soil in a small container. Water and place in bright, indirect light. Enclosing the pot in a clear plastic bag can help maintain humidity that will help speed rooting, as will keeping it at warm temperatures, 65°F to 75°F (18°C to 24°C. Some people also report success with rooting stems in water before planting in soil.",
    },
    {
        "id" : 69,
        "name": "Venus Fly Trap",
        "size": "small",
        "difficulty": "advanced",
        "light": "high",
        "flowering": "yes",
        "water": "high",
        "about": "The Venus flytrap is special because it, along with the very rare waterwheel plant, is one of only two carnivorous plant species with a “snap-trap” mechanism for capturing prey, reports Cosmos. When potential prey bumps the trigger hairs on the surface of the snap-trap twice within 20 seconds, the leafy jaws clamp shut, according to The New York Times. Once trapped inside, the prey struggles for freedom, activating the trigger hairs again, signaling to the plant to release digestive enzymes.",
        "care": "Water: Most tap water contains too many minerals and dissolved salts for carnivorous plants to tolerate. That’s why Rodale recommends collecting rainwater or buying distilled water for your Venus flytrap. Venus flytraps also like high humidity and for their soil to be wet at all times, though not so soggy that they get mildewy. For this reason, many care guides, including Rodale’s, suggest growing them in closed terrariums to simplify care. Feeding: This is the fun part! Because Venus flytraps get their nutrients from flesh rather than soil, you’re going to have to feed yours. Sure, it might catch the odd fly indoors, but probably not frequently enough to sustain it long-term. Plus, it will grow much faster if you feed it, according to the ICPS. They recommend giving the plant dried bloodworms (you can usually find them at a pet store in the fish food section) about once per week. When you feed it, you’ll need to stimulate the trigger hairs with a toothpick so that they snap shut shut on the “prey.”",
        "propogate": "Another way to propagate Venus flytraps is through tissue culture, or in vitro propagation. This method is for the advanced cultivator who has access to a laboratory or wants to try challenging work at home. The plants don’t grow in any kind of soil, but rather in Petri dishes. Venus flytraps can be propagated through tissue culture by using seeds, leaves, or flower stalks. Tissue culture is the fastest way to produce a lot of plants. It is the preferred method of rapidly propagating genetically identical plants, such as Venus flytrap cultivars.",
    },
    {
        "id" : 70,
        "name": "Xanadu",
        "size": "medium",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "no",
        "water": "medium",
        "about": "The philodendron Xanadu is a member of the plant family Araceae. It originated in Brazil as the Winterbourn Philodendron, but was renamed the Philodendron Xanadu by House Plants of Australia in 1988. A Xanadu plant can be grown indoors or outdoors. It tends to spread its “toothed” foliage wider instead of growing vertically, sometimes reaching widths of 5 feet; if kept indoors, it will not spread as much. Sorry, animal owners: according to ASPCA, this plant is toxic to cats and dogs.",
        "care": "Since the Xanadu is a tropical plant, it prefers medium to bright indirect light.  If your Xanadu is indoors, this means it might do best by a window with a sheer curtain or something that’s filtering the sunlight. That way, the light is not shining directly on the plant, but it is still getting a good amount of sun time.  For outdoor growth, an area with light shade is best. Regarding your watering routine, these plants like to dry slightly in between waterings, so always check the soil by sticking your finger about one inch down to ensure you’re not overwatering. If the soil is moist to the touch, wait a little bit before watering again. The Xanadu can take a higher humidity area, but it has also adapted to more normal house conditions, so humidity is not as much of a concern as fertilizing. The plant appreciates regular fertilization.",
        "propogate": "You can propagate a Xanadu through division or cutting. To propagate through division, when you are repotting your plant, separate a portion of the plant by gently pulling apart one “clump” of the plant and carefully separating the roots, then repotting it in a separate container.",
    },
    {
        "id" : 71,
        "name": "Yucca",
        "size": "medium",
        "difficulty": "easy",
        "light": "high",
        "flowering": "yes",
        "water": "low",
        "about": "Yucca plants are striking and low maintenance—a perfect combo for ideal houseplants. We’re talking about years of easy greenery: slow-growing, drought-tolerant, pest-resistant. And because they’re crazy easy to propagate, you can share the love with your friends.",
        "care": "Giving your yucca plant the right kind of soil is somewhat of a balancing act. Yuccas do not need high-quality soil, but it needs to be well-draining. However, it still needs to be heavy enough to hold the plant upright. Yucca plant soil should also retain water well. Try a 3:1 mixture of sand and peat in your container.An interesting characteristic of yucca plants is that they like to be root-bound in small pots, so re-potting should only be done every other year or so at most. Yucca plants prefer to be on the dry side and are considered drought-tolerant plants, which makes sense given their desert origins. In general, allow about the top half of the soil to become dry before watering.More specific watering requirements will depend on how much light your yucca plant receives. In lower light conditions, water your plant less; in brighter light conditions, water your plant a bit more. Overwatering is probably the only way to kill a yucca.",
        "propogate": "Propagating your yucca plant can be done in two main ways: through division or through pups. Propagation is best done in the fall. To propagate by division, separate the rhizomes beneath the soil and plant your new yucca plant in appropriate soil and place it in a sunny location. Keep the plant lightly moist until roots are established.",
    },
    {
        "id" : 72,
        "name": "ZZ Plant",
        "size": "medium",
        "difficulty": "easy",
        "light": "medium",
        "flowering": "no",
        "water": "low",
        "about": "The ZZ plant, (or Zanzibar gem) is known by the scientific name Zamioculcas zamiifolia. It hails from eastern Africa, where it is adapted to survive months of drought and low light. The plant’s bulb-like rhizomes store water during dry periods, which is part of what makes it such a resilient houseplant. The ASPCA doesn’t have an entry about ZZ plant toxicity, but other sources indicate that it’s likely poisonous to dogs and cats.",
        "care": "As with many indoor plants, the biggest killer of ZZ plants is overwatering. If the roots are kept constantly wet, they will rot, killing the plant. This also means that the plant needs good drainage, so plant it in a pot with holes in the bottom, and use a fast-draining succulent or cactus potting mix. (A fellow plant-lover and I were recently sharing our shame over “indestructible” plants we’ve killed, and hers was a ZZ plant, and mine was a spider plant, both of which died from rotted roots due to lack of drainage. Proper drainage is key!) It’s best to err on the side of less when watering this plant, letting the top inch or two of the soil dry out before watering again, approximately every week or two. A guideline to keep in mind is that the plant needs more water the more light it gets, and vice versa. This applies to seasonal light levels, too. With this plant, dropping leaves usually means it’s not getting enough water, while yellowing leaves would indicate too much.",
        "propogate": "The fastest and easiest way to propagate a ZZ plant is by dividing the tuberous roots. Remove the plant from its pot, gently separate individual rhizomes, and plant them in their own pots. You can also place whole stalks in water, or individual leaves in soil, and they will eventually form roots of their own, but this is a slow process that can take over a year.",
    },
]
