[
    {
        "id" : 1,
        "title": "Watering Guide",
        "sec1": "About Watering",
        "con1": "Whether you’re a green thumb or not, you probably already know that all plants need water to thrive—after all, that basic knowledge goes back to introductory middle-school science class. What you might not know is that incorrect watering techniques can put plants at risk for disease and even kill them. Whether you want to cultivate pretty outdoor perennials or you just want to properly care for your new houseplant, heed these best and worst practices for watering plants and you’ll reap healthy, happy specimens.",
        "sec2": "Do's",
        "con2": "DO hydrate plants in the morning: The most efficient time to water outdoor flowers and vegetables is early in the day, when the soil is cool and water has the best chance of seeping down to the roots of the plants before it evaporates. Watering plants in the morning will ensure that they have sufficient store of moisture beneath the soil to withstand the heat of a hot summer day. \r \rDO water plants at soil level: Directing water at the base of your plants delivers the hydration right where it’s needed: the roots. Consider winding a soaker hose between plants in a flower or vegetable bed to soak the soil slowly and deeply, and ensure healthy growth. \r \rDO water outdoor container plants at least once per day: Soil in container gardens and flowerpots dries out more quickly than soil in a garden plot or flower bed. The smaller the container, the more frequently you need to water the plant inside it. Soak potted plants’ soil in the morning, and, if the mercury in the thermometer climbs to 90 or above, give it another soaking in the afternoon. Alternatively, outfit the pot with an automatic plant waterer, which is basically a hollow spike attached to a water bottle or bulb. When the spike is inserted in the pot, water slowly seeps into the soil, offering the plant a steady supply of moisture. ",
        "sec3": "Don'ts",
        "con3": "DON’T water too frequently—or not frequently enough: Especially during hot weather, it may be tempting to water just enough—and often enough—to keep the soil damp. Shallow surface watering, however, discourages deep root development. Instead, opt for a less frequent watering routine that thoroughly saturates the soil. This method encourages the plants’ roots to reach deeply for residual water, even when the surface of the soil appears dry. The standard rule of thumb is to give your flowers and vegetables the equivalent of at 1 inch of water per week (and as much as double that amount in the peak of summer). \r \rDON’T use broadcast sprinklers: In addition to soaking the plant’s leaves, which can increase the risk of a fungal disease, broadcast lawn sprinklers are simply inefficient. On a hot or windy day, much of the water distributed by this type of sprinkler can evaporate before it reaches the plant. What’s more, sprinklers are likely to dampen plants’ leaves, and wet leaves can make the plant prone to mold and disease. \r \rDON’T forget that trees need water, too: Newly planted trees and shrubs should be thoroughly soaked with water two or three times per week for the first month. After that period, water weekly during their first growing season. Established trees and shrubs that are at least two years old only need to be watered once every two weeks during the growing season when rain is scarce.",
    },
    {
        "id" : 2,
        "title": "Lighting Guide",
        "sec1": "About Lighting",
        "con1": "So you've decided to take the plunge and treat your plants to grow lights. You've done your research, selected the lights you want to use and now it's time to take the final step and hang your lights.",
        "sec2": "Decide on the area",
        "con2": "The area where you want to place your grow lights it's important because it impacts the bulbs you would buy and any accessories you might require.For example, if you need to cover a larger area, you might want to consider stronger bulbs to cover a bigger radius. It's also important to note how much natural light is your selected are receiving, as this will help you understand how many lights you would need. For example, if the area has a decent natural light and you only need to supplement it due to seasons or amount of plants sharing the space, then you might only need a few lights.",
        "sec3": "Creating your setup",
        "con3": "I'm not going to give you guidelines for this as it's mostly driven by preferences. My only advice when you get to this stage is to keep in mind that plants will grow so your lights might need adjusting over time.My other advice is around grow lights in living areas. If you have them in rooms where you usually spend a lot of time in (such as a living room) think about you as well. Position the lights so that the bulbs face away from you (you don't want lights blinding you when you watch TV or sit on the sofa).",
    },
    {
        "id" : 3,
        "title": "Repotting Guide",
        "sec1": "About Repotting",
        "con1": "Repotting plants is a simple task, but there are a few tips and tricks to maximize the benefits of this plant care routine.",
        "sec2": "Do's",
        "con2": "DO Repot in the spring or summer: The best time to repot is when your plant is in active growing phase, or during the spring and summer. This is when your plant is at its strongest, and will bounce back from any stress more easily. \r \rDO Repot in the Same or Slightly Bigger Container: Repotting doesn’t always mean giving your plant a bigger pot. Sometimes you’ll repot just to provide your plant with fresh new soil. That said, if you do decide to size up, use a pot that’s only slightly bigger in diameter — 2 inches is great — so that your plant still enjoys a snug home. \r \rDo Consider Separating If Necessary: Sometimes plants will be too big for their own good. If sizing up is not an option, you may consider separating your plant into two or more plants (this is a method of propagation). ",
        "sec3": "Dont's",
        "con3": "Don’t Size Down (Usually): In most cases, you will either keep the same size or size up when repotting. There is no benefit to repotting in a smaller pot unless you are propagating and separating the plant into two or more new ones, or you are repotting a plant that has had root rot and as a consequence has very few healthy roots left. \r \rDon’t Repot Into A Huge Container: A big part of repotting is giving plants more room to grow. That said, you don’t want to give them too much room. Why’s that? Most plants like to have their roots very snugly packed. A pot that’s too big may lead to poor root health and a sad looking plant overall. \r \rDON’T Leave Any Air In The Soil: Make sure that your plant’s new soil is well-packed when repotting. This not only adds stability to the plant, but also ensures their soil is as nutrient-dense as possible!",
    },
    {
        "id" : 4,
        "title": "Nutrient Guide",
        "sec1": "About Nutrients",
        "con1": "Nutrients are essential elements that plants use for growth, development and reproduction. Plants need a balanced source of nutrients to support growth. ",
        "sec2": "Do's",
        "con2": "Do contact a landscape designer/architect before you break ground for a new home and have them involved in every step of the planning process. Many permanent errors can be avoided by this one decision, including house siting, placement of driveways, parking and turn-around areas, sidewalks - to mention just a few. \r \rDo plant a magnificent Bur Oak (Quercus macrocarpa) if you have plenty of space and believe in leaving a legacy for generations to come. These drought-resistant trees that are native to eastern Montana are the only oaks we see growing successfully in our high pH Montana soils. Don't waste precious time attempting to grow other oak trees because they don't thrive in the long haul here.",
        "sec3": "Don'ts",
        "con3": "Don't dump wood ash onto your soil if you're trying to improve it. Contrary to what you may read elsewhere, wood ash is not recommended for most Montana soils. The reason is that it raises the pH level of soil and in Montana we need to put energy into lowering it. Our Montana soils are generally alkaline and adding wood ash (calcium carbonate/lime) just adds fuel to the fire. Instead if you want to improve your soil pH add acidic soil amendments such as peat moss. \r \rDon't use garden soil in plant containers if your want healthy plants. Instead use potting soil. The reasons for this are that garden soil: 1) in containers drains poorly and plants tend to be waterlogged, while on the contrary, potting soils have better aeration; 2) shrinks as it dries and in so doing tends to pull away from the sides of the container; 3) unlike most light-weight potting soils, is heavy, making containers difficult to move. \r \rDon't rush to fertilize your plants when their leaves turn yellow and they look sickly. First be sure they're not suffering from over-watering. Plants need air just as much as they need water. When you over-water you displace air with water and literally drown your plants. Remember that roots require oxygen just as people do.",
    },
    {
        "id" : 5,
        "title": "Shedding Guide",
        "sec1": "About Shedding",
        "con1": "When leaves drop, it can be quite disheartening, especially if you don’t know why it’s happening. While some leaf loss is normal, there may be many reasons for a plant losing leaves, and not all of them are good. In order to pinpoint the likely cause, it helps to thoroughly examine the plant and take note of any pests or environmental factors that may be affecting its overall health.",
        "sec2": "Plant Shock",
        "con2": "Abrupt changes in a plant's environment can cause sudden leaf loss. Many kinds of plants, including fiddle leaf figs, weeping ficus trees, rubber plants and crotons, are very sensitive to change. The shock of moving from one part of your house to another can make some plants quickly shed leaves. That's one reason to always let plants gradually acclimate to new conditions. If your plant dropped its leaves suddenly, consider what has changed. Hurried shifts in location, lighting, temperature, wind and humidity can all cause leaf drop. Seasonal changes in heating duct use or drafts from fans or air conditioning indoors can do the same. So can playing pets and kids. If you repotted your plant recently, transplant shock could be involved. Pennington UltraGreen Plant Starter with Vitamin B1 at planting time reduces transplant shock and helps keep leaves where they belong.",
        "sec3": "Improper Watering",
        "con3": "Overwatering and underwatering can both cause leaves to drop from plants. When improper watering is to blame, leaf drop rarely happens suddenly. Plants give plenty of signals that a problem is building. With overwatering, you may see plant leaves turn yellow first. If overly wet soil leads to root rot, leaves may turn soft and black. When plants are underwatered, leaves can turn brown and look scorched before they fall. Some plants are prone to drop leaves when stressed by water problems. These include Christmas cactus, jade plants, indoor lemon trees, and Schefflera or umbrella plants. Take the guesswork out of getting water right, and match your watering to the plants you grow. If you grow drought-tolerant succulents, they'll do best when soil dries out slightly between waterings. Most garden centers and online retailers offer inexpensive moisture meters that tell you whether soil at root level is wet or dry. You can also go low-tech and test the soil with your finger. If the soil feels cool and moist a finger's length down, don't water. If it feels dry, give your plant the drink it needs.",
    },
    {
        "id" : 6,
        "title": "Disease Guide",
        "sec1": "About Diseases",
        "con1": "A plant disease is defined as “anything that prevents a plant from performing to its maximum potential.” This definition is broad and includes abiotic and biotic plant diseases.",
        "sec2": "Abiotic or non-infectious diseases",
        "con2": "These diseases are caused by conditions external to the plant, not living agents. They cannot spread from plant to plant, but are very common and should be considered when assessing the health of any plant. Examples of abiotic diseases include nutritional deficiencies, soil compaction, salt injury, ice, and sun scorch ",
        "sec3": "Biotic or infectious diseases",
        "con3": "These diseases are caused by living organisms. They are called plant pathogens when they infect plants. For the purposes of discussing plant pathology, only plant disease pathogens will be discussed. Pathogens can spread from plant to plant and may infect all types of plant tissue including leaves, shoots, stems, crowns, roots, tubers, fruit, seeds and vascular tissues ",
    },
]
